{"chunk_id": "script_4_chunk_0", "original_file": "script_4.txt", "section_index": 0, "chunk_index": 0, "content": "For more details Click here\n--- Interest Rate Box ---\nInterest Rate: 7.45 %P.A*\n--- Features & Benefits ---\n- Low EMI\n- Higher Loan Amount\n- Track my Loan\n- Approved Car Dealers\n- Simplified Disbursement\n- No Processing Fee\n- No Hidden Charges\n- No Prepayment Penalty\n* 0.25 % Concession in ROI for Corporate salary account Holder and Existing Housing Loan borrower\n* Maximum Funding 90%\n* Interest charged on daily reducing Balance\n* No Pre-Payment / Pre-closure / Part payment Charges\n* Quick turnaround time\n-", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-0"}
{"chunk_id": "script_4_chunk_1", "original_file": "script_4.txt", "section_index": 0, "chunk_index": 1, "content": "e / Part payment Charges\n* Quick turnaround time\n- -- Documents Required ---\n- Two Passport Size Photographs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-0"}
{"chunk_id": "script_4_chunk_2", "original_file": "script_4.txt", "section_index": 0, "chunk_index": 2, "content": "ents Required ---\n- Two Passport Size Photographs. - Proof of Identification: (any one)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-0"}
{"chunk_id": "script_4_chunk_3", "original_file": "script_4.txt", "section_index": 1, "chunk_index": 0, "content": "Passport\n- For Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. Undertaking from employer for remittance of monthly installment, wherever feasible.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-1"}
{"chunk_id": "script_4_chunk_4", "original_file": "script_4.txt", "section_index": 1, "chunk_index": 1, "content": "ittance of monthly installment, wherever feasible. Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n- For Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-1"}
{"chunk_id": "script_4_chunk_5", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 0, "content": "Bank statement for past one year\n- Other documents as applicable as per scheme of loan\n--- Interest Rates ---\nCar Loan Interest Rate: 7.45 %P.A*\n--- EMI Calculator ---\nMonthly Payment (EMI): Rs. 2001\nTotal Interest: Rs. 20085\nTotal Repayment: Rs. 120085\n--- Eligibility ---\nHow will Bank of Maharashtra decide the car loan amount i am eligible for? --- How to Apply ---\nFollow the step by step instructions to avail digital loan facility from our bank. --- FAQs ---\nQ: What is a Car loan and how does it work?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_6", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 1, "content": "Qs ---\nQ: What is a Car loan and how does it work? A: Maha Super Car Loan is for purchase of new four-wheeler i.e.Car, Jeep , Multi Utility vehicles (MUV)\nQ: How to get your Car Loan Approved Faster? A: A critical factor in getting a loan approved fast is determining how much EMI you are comfortable paying. Use our Car Loan EMI calculator to estimate how much you will need to set aside.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_7", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 2, "content": "r to estimate how much you will need to set aside. These will enable you to plan and prepare for the Car Loan application process.To make sure your Car Loan is approved faster; the key is to provide all the necessary documents and complete your Know your Customer (KYC) formalities. Q: How can I know what my EMI amount is? A: You can use the EMI Calculator to know your EMI amount before applying for the Loan. Q: What are the minimum and maximum tenures of a Car Loan? A: Bank of Maharashtra offers flexible tenures on their Car Loan products.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_8", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 3, "content": "ffers flexible tenures on their Car Loan products. The maximum tenure is 84 months. Q: How much Car Loan can I get on my salary? A: Car Loan is usually give upto 36 times of net monthly salary and 90% of the cost of car value depending on the repaying capacity such that the overall deuctions does not exceed 65% of Gross Income (including proposed EMI).For example: A person having gross monthly salary of Rs. 40000 and deduction of Rs. 5000 making his net monthly salary of Rs. 35000 is eligible for car loan of Rs. 1260000\nQ: What is a Vehicle loan Agreement?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_9", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 4, "content": "f Rs. 1260000\nQ: What is a Vehicle loan Agreement? A: Vehicle loan agreement is an agreement containing important clauses executed between lender and borrower/coborrower/guarantor for grant of loan for purchase of a vehicle. Q: What is car loan interest rate in Bank of Maharashtra? A: Interest rates for Car loan at Bank of Maharashtra are based on the Repo Linked Lending Rate (RLLR) and Credit Score of the customer. Currently it starts from 7.45% - 12.00%. Q: How is EMI calculated on car loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_10", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 5, "content": "5% - 12.00%. Q: How is EMI calculated on car loan? A: EMIs are calculated based on the loan amount, interest rate and loan tenure. To calculate your EMI, you can use the EMI Calculator. Q: What is Bank of Maharashtra commercial car loan interest rate? A: Interest rate for Commercial Car Loan is based on a variety of factors such as credit score, credit rating, collateral offered, amount of loan etc. Q: How do I calculate my interest rate or EMI on a car loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_11", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 6, "content": "I calculate my interest rate or EMI on a car loan? A: Interest rates for car loan are based on the Repo Linked Lending Rate (RLLR) and Credit Score of the customer starting from 7.45% - 12.00%. Q: Is there any pre-payment or fore closure charges in vehicle loan? A: There are No Pre-Payment / Pre-Closure / Part-Payment Charges. Q: What is the maximum tenure on Bank of Maharashtra Vehicle laon? A: The maximum tenure is 84 months.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
