{"id": "script_1.txt-0", "file_name": "script_1.txt", "section_index": 0, "content": "Passport\n- For Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer.\nUndertaking from employer for remittance of monthly installment, wherever feasible.\nBank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n- For Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc.", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-1", "file_name": "script_1.txt", "section_index": 1, "content": "Bank statement for past one year\n- Guarantor forms along with net worth proof /income proof (if applicable)\n- Guarantor's IT return along with KYC documents as mentioned in point 3 & 4\n- In case of Takeover(Refinance):", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-2", "file_name": "script_1.txt", "section_index": 2, "content": "Documents Acknowledgement Receipt from Bank\n- Property Documents:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-3", "file_name": "script_1.txt", "section_index": 3, "content": "Receipts for payments made for purchase of the residential unit\nCopy of approved drawings of proposed construction/purchase\nPermission from competent authority for construction of flat/house\nPermission from competent authority under Urban Land ceiling & Regulation Act 1976\nAgreement of Sale/Sale Deed/Detailed cost estimate from Regd.Architect/Engineer for the property to be constructed.\nAllotment letter from the Builder/Co-operative Society/Development Authorities/Association of apartment owners etc.\nOther documents depending upon:\nProperty to be purchased directly from Builder (Ready/Under-construction)\nProperty belonging to a Registered Co-operative Housing Society\nPurchase in resale.", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-4", "file_name": "script_1.txt", "section_index": 4, "content": "Direct sale by any Development authority\nConstruction of house on separate plot of land.\n- Additional Documents for NRIs\nCopy of employment Contract (if the contract is in any language other than English, the same has to be translated into English and attested by Employer /Indian Embassy)", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-5", "file_name": "script_1.txt", "section_index": 5, "content": "Copy of Identity Card issued by the current Employer\nContinuous Discharge certificate, if applicable", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-6", "file_name": "script_1.txt", "section_index": 6, "content": "Overseas Bank account statements for last 6 months in which salary is credited\nA Salary certificate/income statement duly attested by out foreign office including subsidiary office/certified by the competent authority available in the country may be produced. This may also include Chartered /Certified Accountants, Officials of Inland Revenue dept.(similar to Income Tax Authorities in India) or any other agency specified for the purpose. Where ever attestation is not possible, this may be submitted duly notarized.\n- Additional Documents for PIOs\nA photocopy of PIO card or any of the under noted documents:-\nCurrent Passport indicating birth place of India/Abroad\nIndian Passport, if held earlier\nParents or grandparents passport with details there in substantiating his claim of being PIO.\n--- Interest Rates ---\nHousing Loan Interest Rate: 7.10 %P.A*\n--- EMI Calculator ---\nMonthly Payment (EMI): Rs. 1985\nTotal Interest: Rs. 19090\nTotal Repayment: Rs. 119090\n--- Eligibility ---\nHow will Bank of Maharashtra decide the home loan amount i am eligible for?\n--- How to Apply ---\nFollow the step by step instructions to avail digital loan facility from our bank.\n--- FAQs ---\nQ: What is a Home loan and how does it work?\nA: Home loans are availed forConstruction/acquiring of new or existing house/flat and extension of existing house/flat. Home loan to purchase new flat Home extension loanPurchase of plot and construction there on.For Repairs /renovation/alternation of existing house/flat for new standalone borrowers.A Bank of Maharashtra home loan provides numerous benefits such as facility to apply online, quick loan processing, attractive interest rates, customized repayment options and simple & hassle-free documentation.\nQ: What are the features of Home loan?\nA: The features of Maha Super Housing Loan are as below:0.05% concession to women and defence personal.Maximum tenure up to 30 years/up to 75 years of age.No Pre-payment/Pre-closure/Part payment charges.Concession in ROI for Housing Loan borrower in Car Loan and Education loan.Bank of Maharashtra Offers Lowest Interest Rate on Home Loan in India\nQ: How will Bank of Maharashtra decide the home loan amount i am eligible for?\nA: Maximum loan amount will be lowest of loan amount assessed on the basis of Permissible Deduction norms, Maximum permissible LTV ratio, Loan amount requested.\nQ: When does my home loan EMIs start?\nA: EMI's begins from the month subsequent to the month in which disbursement of the loan is done. For loans for under-construction properties EMI usually begins after the complete home loan is disbursed but customers can choose to begin their emi's as soon as they avail their first disbursement and their emi's will increase proportionately with every subsequent disbursement. For resale cases, since the whole loan amount is disbursed in one go, emi on the whole loan amount start from the subsequent to the month of disbursement\nQ: Can home loan be transferred from one bank to another?\nA: Yes, it is possible to transfer a home loan in India, from one Bank to another under certain circumstances. Home loan transfer typically refers to the process of transferring an existing home loan from one bank or financial institution to another. This is done to take advantage of better interest rates, lower fees or improved loan terms offered by the new lender\nQ: What is floating interest rate?\nA: A floating interest rate sometimes known as variable interest rate, is an interest rate that varies over time according to changes in a reference rate or index. It's often used in financial products like mortgages, home loans and other investments.\nQ: What is the EMI for 50 lakhs home loan?\nA: For calculating the EMI (Equated Monthly Installment) for a home loan in India, we must also consider the loan amount, interest rate and loan period. To get accurate EMI estimate, visit the website of Bank of Maharashtra & calculate the precise EMI cost using home loan EMI calculator.The approximate EMI for a 50 lakhs home loan with an interest rate of 7.10% per annum and 15 year tenure would be around ₹45221\nQ: What are the different type of home loan available?\nA: Depending upon the needs and requirements of customers, there are different types of home loans available in India. Some of the popular types of home loans includes, Plot Purchase & Construction thereon LoansHome/Flat Purchase LoansLoans for repair/renovation of existing homesHome Extension LoanNRI Home LoansBank of Maharashtra provides varieties of home loans under Maha Super Housing Loan Scheme.\nQ: Which factor affect home loan eligibility?\nA: Some of the factors that affect home loan eligibility in India are: IncomeCredit ScoreEmployment StabilityAgeExisting Debt ObligationsDown PaymentProperty Value and LocationLoan Tenure\nQ: Can home loan be taken jointly?\nA: Yes, it is possible to obtain a home loan in India jointlyalong with close relatives. Joint home loans are common which offer various benefits to customers. When two or more people apply for a home loan together, they are sharing the obligation as well as eligible for higher loan amount.\nQ: How to get a home loan with ease?\nA: Obtaining a home loan in India is an important financial decision. While the procedure may require some documentation and effort, there are several steps you can do to improve your possibilities of getting approved for a home loan. Check if you're eligibleMaintain good credit scoreChoose the right loan typeOrganize your documents\nQ: How to check home loan eligibility?\nA: To check home loan eligibility in India, you need to consider the following criteria: Consider your income and financial stabilityDetermine your credit scoreFigure out your repayment abilityMake use of online eligibility calculators\nQ: Who can be a co-applicant?\nA: A co-applicant can be any person who shares the financial obligation and accountability of the loan with the primary applicant while applying for a home loan in India. The co-applicant will be considered as an equal borrower and equally accountable for loan repayment. It can be the primary applicant's spouse, parents, children, siblings or other close family relatives who have a stable source of income\nQ: When does my loan repayment period begin?\nA: The repayment period for a home loan typically begins after the loan has been disbursed to you and/or the property purchasetransaction has been completed. This means that once you have received the funds and the ownership of the home has been transferred to you, your repayment obligations will start.The specific start date of your home loan repayment period should be outlined in the loan agreement you signed with the lender. It's important to review your loan agreement to understand the terms and conditions, including the repayment start date, repayment schedule, interest rate, and any other relevant details pertaining to your specific loan.\nQ: For what purpose Can I take top up home loan ?\nA: Top-Loan on your home loan can be availed for various purposes such as repairs and renovations and other expenses such as weddings, education etc.\nQ: What is the interest rate of top up loan in BoM?\nA: ROI on Top -up loans for repair and renovation as well as for any other purpose will be 20bps higher than that applicable on the Maha Super Housing Loan Scheme (currently).\nQ: What are the benefits of home top up loan ?\nA: The benefits of a Home Top-Up Loan include access to additional funds for various purposes such as repairs and renovation, marriage and other related expenses at lower interest rates compared to personal loans. Additionally, the repayment tenure on Top-Up loans is higher than that of personal loans.\nQ: How many times we can get top up home loan?\nA: There is no limit on the number of times you can avail of a Top-up loan on your home loan depending on fulfilling other terms and conditions as per the Top-Up Loan. However, only one top-up loan can be active at any given point in time.\nQ: What is eligibility for home loan in Bank of Maharashtra?\nA: For Resident Indians: Individual salaried employees (with a permanent job for a period of minimum 1-year continuous service) of State/ Central Government/ Public/ Private Sector Companies of repute, Self-Employed Professionals, and Businessmen.Non-resident Indians (NRIs) holding Indian Passport, Persons of Indian Origin (PICOs), and Overseas Citizens of India (OCI) are treated as NRIs: Salaried applicants/ co-applicant/s (whose income can be considered for eligibility), should have a regular job abroad in a reputed Indian/ Foreign Company, Organization or Government Department having a valid job contract/work permit for the minimum past 2 years.\nQ: How can we apply for home loan?\nA: To apply for a Home Loan, one can either visit the nearest branch and complete all the required formalities or apply online through Bank of Maharashtra's website: bankofmaharashtra.bank.in\nQ: How much time does it take to sanction home loan?\nA: On average, loans are disbursed within 3-10 days after satisfactory completion of documentation and all the required procedures.\nQ: What is home loan interest rate at bank of maharashtra?\nA: Interest rates for Home Loans depend on a variety of factors such as Credit Score, amount of loan, profession etc. For more information on Interest rates on Home loans click on www.bankofmaharashtra.bank.in\nQ: How to get home loan for construction of house?\nA: To apply for a Home loan, you can apply online through our website (bankofmaharashtra.bank.in ) or can visit the nearest branch and complete all the required formalities.\nQ: what is the interest rate for home loan for womens?\nA: Yes, Home loan interest rates are lower for women than those applicable to others. The bank offers a 0.05% concession on home loans to women, subject to certain terms and conditions.\nQ: How much percentage interest for BoM home loan for womens?\nA: Interest rates for Home Loans depend on variety of factors such as credit score, amount of loan, profession etc. Additionally, Bank of Maharashtra offers a 0.05% concession on interest for women borrowers.\nQ: What is bank of maharashtra home loan processing fee?\nA: The applicable processing fee is 0.25% of the loan amount plus applicable GST.Note: Processing Fees waiver for the period upto 31.12.2025\nQ: who can be co applicant for home loan?\nA: All co-owners of the property need to be co-applicants to the home loan. Generally, co-applicants are close family members.\nQ: How does home loan tenure affect your interest rate?\nA: No, Home loan tenure doesn't affect your interest rates. Interest rates on Bank of Maharashtra home loans are calculated based on the credit score of the applicant/s.\nQ: Is it compulsory to take home loan insurance?\nA: While not mandatory, the Bank strongly recommends considering Home Loan insurance. This insurance acts as a safety net, safeguarding your Home Loan in the event of unforeseen circumstances.\nQ: Is there any prepayment or foreclosure charges in home loan?\nA: There are no Pre-Payment / Pre-Closure / Part-Payment Charges\nQ: What is the maximum tenure on Bank of Maharashtra home laon?\nA: The maximum tenure for Bank of Maharashtra Home Loan is up to 30 years or until the borrower reaches the age of 75 years, whichever is earlier.\n--- Navigated to 'Purchase of New House/Flat' page ---\nURL: https://bankofmaharashtra.bank.in/maha-super-housing-loan-scheme-for-construction-acquiring\n--- Scheme Table ---\nS.No: 1\nParticulars: Purpose\nScheme guidelines:\nFor purchasing of new Residential unit (House, flat, Bungalow etc.) under construction /ready directly from the builders/ developers/society/other agencies/Development authority.\nFor purchasing of old Residential unit (House, flat, Bungalow etc.).\nConstruction of a residential unit in owned Plot /Land.\nFor extension (additional construction) in the existing house/flat\nTakeover of existing Housing Loan accounts of the applicants under standard category availed from other Banks / Housing Financial Institutions\n - For purchasing of new Residential unit (House, flat, Bungalow etc.) under construction /ready directly from the builders/ developers/society/other agencies/Development authority.\n - For purchasing of old Residential unit (House, flat, Bungalow etc.).\n - Construction of a residential unit in owned Plot /Land.\nFor extension (additional construction) in the existing house/flat\n - For extension (additional construction) in the existing house/flat\n - Takeover of existing Housing Loan accounts of the applicants under standard category availed from other Banks / Housing Financial Institutions\nS.No: 2\nParticulars: Eligibility\nScheme guidelines:\n1. Resident Indian Citizen  2. Non- Resident Indians (NRIs) or Persons of Indian Origin (PIOs) or Overseas Citizens of India\nS.No: 3\nParticulars: Eligible Quantum of Loan\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-7", "file_name": "script_1.txt", "section_index": 7, "content": "Maximum loan amount will be lowest of loan amount assessed on the basis of", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-8", "file_name": "script_1.txt", "section_index": 8, "content": "Maximum permissible LTV ratio\nLoan amount requested.\n - Permissible Deduction norms\n - Maximum permissible LTV ratio\n - Loan amount requested.\nS.No: 5\nParticulars: Moratorium Period\nScheme guidelines:\nMaximum 48 months. However interest may be capitalized for a maximum period of 18 months thereafter Interest to be serviced as and when applied\nS.No: 6\nParticulars: Repayment period\nScheme guidelines:\nMaximum Repayment period of 30 years or on borrower reaching the age of 75 years whichever is earlier.\nS.No: 7\nParticulars: Rate of Interest\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-9", "file_name": "script_1.txt", "section_index": 9, "content": "Click here to view the Interest Rate\nS.No: 8\nParticulars: Deduction\nScheme guidelines:\nFor salaried individuals.\nUp to 80% based on latest monthly income\nFor Non-Salaried Individuals\nUp to 80% based on average annual income ​\nS.No: 9\nParticulars: Security\nScheme guidelines:\nEquitable / Registered Mortgage of Property.\nS.No: 10\nParticulars: Processing Fee\nScheme guidelines:\n0.25 % of the loan amount (Subject to max. of Rs. 25,000/-)\nFull waiver of Processing Fee for Govt. /State /Central Government / Public sector Employees in case of Takeover Loans\nS.No: 11\nParticulars: Inclusion of cost of Solar Photo Lightening System /Rooftop Solar plant\nScheme guidelines:\nThe cost of rooftop Solar Photo Voltaic System / Rooftop Solar plant may be included in the project cost\nfor arriving at the Home Loan eligibility for purchase / Construction / Extension (additional construction) of residential units\nin respect of all applicants willing to install such system. The cost of consideration will be based upon the quotation received\nfrom the authorized dealers/agencies\n--- Navigated to 'Purchase of Plot and construction thereon' page ---\nURL: https://bankofmaharashtra.bank.in/maha-super-housing-loan-scheme-for-purchase-plot-construction-thereon\n--- Scheme Table (Purchase of Plot & construction thereon) ---\nS.No: 1\nParticulars: Purpose\nScheme guidelines:\nFor purchase of plot and construction thereon.\nS.No: 2\nParticulars: Eligibility\nScheme guidelines:\n1. Resident Indian Citizen  2. Non- Resident Indians (NRIs) or Persons of Indian Origin (PIOs) or Overseas Citizens of India\nS.No: 3\nParticulars: Eligible Quantum of Loan\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-10", "file_name": "script_1.txt", "section_index": 10, "content": "Maximum loan amount will be lowest of loan amount assessed on the basis of", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-11", "file_name": "script_1.txt", "section_index": 11, "content": "Maximum permissible LTV ratio\nLoan amount requested.\n - Permissible Deduction norms\n - Maximum permissible LTV ratio\n - Loan amount requested.\nS.No: 5\nParticulars: Moratorium Period\nScheme guidelines:\nFor Purchase of Plot – No moratorium period for Plot loan\nFor construction of House - Maximum of 18 months from date of first disbursement.\nS.No: 6\nParticulars: Repayment period\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-12", "file_name": "script_1.txt", "section_index": 12, "content": "Maximum Repayment period of 30 years or on borrower reaching the age of 75 years whichever is earlier\nS.No: 7\nParticulars: Rate of Interest\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-13", "file_name": "script_1.txt", "section_index": 13, "content": "Click here to view the Interest Rate\nS.No: 8\nParticulars: Deduction\nScheme guidelines:\nFor salaried individuals.\nUp to 80% based on latest monthly income\nFor Non-Salaried Individuals\n​Up to 80% based on average annual income\nS.No: 9\nParticulars: Security\nScheme guidelines:\nEquitable / Registered Mortgage of Property.\nS.No: 10\nParticulars: Processing Fee\nScheme guidelines:\n0.25 % of the loan amount (Subject to max. of Rs. 25,000/-)\nFull waiver of Processing Fee for Govt. /State /Central Government / Public sector Employees in case of Takeover Loans\nS.No: 11\nParticulars: Inclusion of cost of Solar Photo Lightening System /Rooftop Solar plant\nScheme guidelines:\nThe cost of rooftop Solar Photo Voltaic System / Rooftop Solar plant may be included in the project cost for arriving at the Home Loan eligibility for purchase / Construction / Extension (additional construction) of residential units in respect of all applicants willing to install such system. The cost of consideration will be based upon the quotation received from the authorized dealers/agencies\n--- Navigated to 'Maha Super Housing Loan Scheme for repairs/renovation/alteration of existing house/flat.' page ---\nURL: https://bankofmaharashtra.bank.in/maha-super-housing-loan-scheme-for-repairs\n--- Scheme Table (Repairs/Renovation/Alteration) ---\nS.No: 1\nParticulars: Scheme Name\nScheme guidelines:\nMaha Super Housing Loan Scheme for repairs/renovation/alteration of existing house/flat.\nS.No: 2\nParticulars: Purpose\nScheme guidelines:\nFor Repair/renovation of an existing residential unit (fixed furnishing, immovable enhancements etc,) which add to the value of the residential unit, for existing and new borrower.\nS.No: 3\nParticulars: Eligibility\nScheme guidelines:\nA) For New borrower.\nResidential House should be unencumbered.\nBorrower should have obtained possession of the house property.\nIn case of takeover, loans under repair & renovation can be considered simultaneously along with takeover of housing loan.\nB) For existing Housing Loan Borrower.\nConstruction of the property for which housing loan has been availed should be completed.\nBorrower should have obtained possession of the house property.\nSatisfactory repayment track record of last 6 months in existing Housing Loan. Satisfactory repayment record means Housing Loan account should not have classified as SMA-1 or SMA-2 or NPA in last six months.\n 1. Residential House should be unencumbered.\n 2. Borrower should have obtained possession of the house property.\n 3. In case of takeover, loans under repair & renovation can be considered simultaneously along with takeover of housing loan.\n 1. Construction of the property for which housing loan has been availed should be completed.\n 3. Satisfactory repayment track record of last 6 months in existing Housing Loan. Satisfactory repayment record means Housing Loan account should not have classified as SMA-1 or SMA-2 or NPA in last six months.\nS.No: 4\nParticulars: Min. Annual Income\nScheme guidelines:\nFor Salaried:Rs.3.00lakh (last year income) - Minimum past 2 year ITR/Form 16 from the Employer is Mandatory.\nFor Self-employed Professionals: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory.\nFor Businessmen: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory.\nFor Persons engaged in Agriculture & Allied activities having ascertainable Minimum income of Rs.3.00lakh.\n - For Salaried:Rs.3.00lakh (last year income) - Minimum past 2 year ITR/Form 16 from the Employer is Mandatory.\n - For Self-employed Professionals: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory.\n - For Businessmen: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory.\n - For Persons engaged in Agriculture & Allied activities having ascertainable Minimum income of Rs.3.00lakh.\nS.No: 5\nParticulars: Age\nScheme guidelines:\nMinimum: The applicant/s must be 21 years old (completed) as on the date of application. However, the minimum age of co-applicant/s can be 18 years.\nMaximum:\n65 Years for Professional working as self-employed i.e. for Doctors/Architects/CAs etc. and Businessman.\n60 years for Salaried Individuals or Retirement age whichever is earlier.\n70 Years for Pensioners\n - 65 Years for Professional working as self-employed i.e. for Doctors/Architects/CAs etc. and Businessman.\n - 60 years for Salaried Individuals or Retirement age whichever is earlier.\n - 70 Years for Pensioners\nS.No: 7\nParticulars: Deduction norms\nScheme guidelines:\nFor Salaried – Up to 80% on latest monthly salary\nFor Non Salaried -  Up to 80% on Average annual Income\nS.No: 8\nParticulars: Repayment\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029"}
{"id": "script_1.txt-14", "file_name": "script_1.txt", "section_index": 14, "content": "Maximum Repayment period of 20 Years\nNo Moratorium period is allowed.\n - Maximum Repayment period of 20 Years\n - No Moratorium period is allowed.\nS.No: 9\nParticulars: Security\nScheme guidelines:\nFor new borrower - Mortgage of the property to be repaired / renovated.\nExisting Housing loan borrower – Additional Mortgage of the property to be repaired / renovated.\n - For new borrower - Mortgage of the property to be repaired / renovated.\n - Existing Housing loan borrower – Additional Mortgage of the property to be repaired / renovated.\nS.No: 10\nParticulars: Processing Fee & Other Charges\nScheme guidelines:\nProcessing Fee – 0.25% of sanctioned amount excluding GST (Min Rs.1000/- & Max Rs.25000/-)\nAccount Handling Charges – Rs 500/- + 0.10% of sanctioned amount excluding GST (Max Rs.11000/-)\nCharges will be applicable as per service charge booklet issued by Bank from time to time.\nS.No: 12\nParticulars: Rate of Interest\nScheme guidelines:\nAs per Rate of Interest structure defined in Maha Super Housing Loan Scheme.", "scraped_date": "2025-12-12T13:31:38.176029"}
