{"chunk_id": "script_1_chunk_0", "original_file": "script_1.txt", "section_index": 0, "chunk_index": 0, "content": "Passport\n- For Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. Undertaking from employer for remittance of monthly installment, wherever feasible.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-0"}
{"chunk_id": "script_1_chunk_1", "original_file": "script_1.txt", "section_index": 0, "chunk_index": 1, "content": "ittance of monthly installment, wherever feasible. Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n- For Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-0"}
{"chunk_id": "script_1_chunk_2", "original_file": "script_1.txt", "section_index": 1, "chunk_index": 0, "content": "Bank statement for past one year\n- Guarantor forms along with net worth proof /income proof (if applicable)\n- Guarantor's IT return along with KYC documents as mentioned in point 3 & 4\n- In case of Takeover(Refinance):", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-1"}
{"chunk_id": "script_1_chunk_3", "original_file": "script_1.txt", "section_index": 2, "chunk_index": 0, "content": "Documents Acknowledgement Receipt from Bank\n- Property Documents:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-2"}
{"chunk_id": "script_1_chunk_4", "original_file": "script_1.txt", "section_index": 3, "chunk_index": 0, "content": "Receipts for payments made for purchase of the residential unit\nCopy of approved drawings of proposed construction/purchase\nPermission from competent authority for construction of flat/house\nPermission from competent authority under Urban Land ceiling & Regulation Act 1976\nAgreement of Sale/Sale Deed/Detailed cost estimate from Regd.Architect/Engineer for the property to be constructed. Allotment letter from the Builder/Co-operative Society/Development Authorities/Association of apartment owners etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-3"}
{"chunk_id": "script_1_chunk_5", "original_file": "script_1.txt", "section_index": 3, "chunk_index": 1, "content": "t Authorities/Association of apartment owners etc. Other documents depending upon:\nProperty to be purchased directly from Builder (Ready/Under-construction)\nProperty belonging to a Registered Co-operative Housing Society\nPurchase in resale.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-3"}
{"chunk_id": "script_1_chunk_6", "original_file": "script_1.txt", "section_index": 4, "chunk_index": 0, "content": "Direct sale by any Development authority\nConstruction of house on separate plot of land.\n- Additional Documents for NRIs\nCopy of employment Contract (if the contract is in any language other than English, the same has to be translated into English and attested by Employer /Indian Embassy)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-4"}
{"chunk_id": "script_1_chunk_7", "original_file": "script_1.txt", "section_index": 5, "chunk_index": 0, "content": "Copy of Identity Card issued by the current Employer\nContinuous Discharge certificate, if applicable", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-5"}
{"chunk_id": "script_1_chunk_8", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 0, "content": "Overseas Bank account statements for last 6 months in which salary is credited\nA Salary certificate/income statement duly attested by out foreign office including subsidiary office/certified by the competent authority available in the country may be produced. This may also include Chartered /Certified Accountants, Officials of Inland Revenue dept.(similar to Income Tax Authorities in India) or any other agency specified for the purpose.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_9", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 1, "content": "ia) or any other agency specified for the purpose. Where ever attestation is not possible, this may be submitted duly notarized. - Additional Documents for PIOs\nA photocopy of PIO card or any of the under noted documents:-\nCurrent Passport indicating birth place of India/Abroad\nIndian Passport, if held earlier\nParents or grandparents passport with details there in substantiating his claim of being PIO. --- Interest Rates ---\nHousing Loan Interest Rate: 7.10 %P.A*\n--- EMI Calculator ---\nMonthly Payment (EMI): Rs. 1985\nTotal Interest: Rs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_10", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 2, "content": "onthly Payment (EMI): Rs. 1985\nTotal Interest: Rs. 19090\nTotal Repayment: Rs. 119090\n--- Eligibility ---\nHow will Bank of Maharashtra decide the home loan amount i am eligible for? --- How to Apply ---\nFollow the step by step instructions to avail digital loan facility from our bank. --- FAQs ---\nQ: What is a Home loan and how does it work? A: Home loans are availed forConstruction/acquiring of new or existing house/flat and extension of existing house/flat.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_11", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 3, "content": "g house/flat and extension of existing house/flat. Home loan to purchase new flat Home extension loanPurchase of plot and construction there on.For Repairs /renovation/alternation of existing house/flat for new standalone borrowers.A Bank of Maharashtra home loan provides numerous benefits such as facility to apply online, quick loan processing, attractive interest rates, customized repayment options and simple & hassle-free documentation. Q: What are the features of Home loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_12", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 4, "content": "umentation. Q: What are the features of Home loan? A: The features of Maha Super Housing Loan are as below:0.05% concession to women and defence personal.Maximum tenure up to 30 years/up to 75 years of age.No Pre-payment/Pre-closure/Part payment charges.Concession in ROI for Housing Loan borrower in Car Loan and Education loan.Bank of Maharashtra Offers Lowest Interest Rate on Home Loan in India\nQ: How will Bank of Maharashtra decide the home loan amount i am eligible for?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_13", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 5, "content": "tra decide the home loan amount i am eligible for? A: Maximum loan amount will be lowest of loan amount assessed on the basis of Permissible Deduction norms, Maximum permissible LTV ratio, Loan amount requested. Q: When does my home loan EMIs start? A: EMI's begins from the month subsequent to the month in which disbursement of the loan is done.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_14", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 6, "content": "e month in which disbursement of the loan is done. For loans for under-construction properties EMI usually begins after the complete home loan is disbursed but customers can choose to begin their emi's as soon as they avail their first disbursement and their emi's will increase proportionately with every subsequent disbursement. For resale cases, since the whole loan amount is disbursed in one go, emi on the whole loan amount start from the subsequent to the month of disbursement\nQ: Can home loan be transferred from one bank to another?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_15", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 7, "content": "home loan be transferred from one bank to another? A: Yes, it is possible to transfer a home loan in India, from one Bank to another under certain circumstances. Home loan transfer typically refers to the process of transferring an existing home loan from one bank or financial institution to another. This is done to take advantage of better interest rates, lower fees or improved loan terms offered by the new lender\nQ: What is floating interest rate?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_16", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 8, "content": " the new lender\nQ: What is floating interest rate? A: A floating interest rate sometimes known as variable interest rate, is an interest rate that varies over time according to changes in a reference rate or index. It's often used in financial products like mortgages, home loans and other investments. Q: What is the EMI for 50 lakhs home loan? A: For calculating the EMI (Equated Monthly Installment) for a home loan in India, we must also consider the loan amount, interest rate and loan period.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_17", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 9, "content": "er the loan amount, interest rate and loan period. To get accurate EMI estimate, visit the website of Bank of Maharashtra & calculate the precise EMI cost using home loan EMI calculator.The approximate EMI for a 50 lakhs home loan with an interest rate of 7.10% per annum and 15 year tenure would be around ₹45221\nQ: What are the different type of home loan available? A: Depending upon the needs and requirements of customers, there are different types of home loans available in India.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_18", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 10, "content": " different types of home loans available in India. Some of the popular types of home loans includes, Plot Purchase & Construction thereon LoansHome/Flat Purchase LoansLoans for repair/renovation of existing homesHome Extension LoanNRI Home LoansBank of Maharashtra provides varieties of home loans under Maha Super Housing Loan Scheme. Q: Which factor affect home loan eligibility?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_19", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 11, "content": "eme. Q: Which factor affect home loan eligibility? A: Some of the factors that affect home loan eligibility in India are: IncomeCredit ScoreEmployment StabilityAgeExisting Debt ObligationsDown PaymentProperty Value and LocationLoan Tenure\nQ: Can home loan be taken jointly? A: Yes, it is possible to obtain a home loan in India jointlyalong with close relatives. Joint home loans are common which offer various benefits to customers.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_20", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 12, "content": " common which offer various benefits to customers. When two or more people apply for a home loan together, they are sharing the obligation as well as eligible for higher loan amount. Q: How to get a home loan with ease? A: Obtaining a home loan in India is an important financial decision. While the procedure may require some documentation and effort, there are several steps you can do to improve your possibilities of getting approved for a home loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_21", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 13, "content": "possibilities of getting approved for a home loan. Check if you're eligibleMaintain good credit scoreChoose the right loan typeOrganize your documents\nQ: How to check home loan eligibility? A: To check home loan eligibility in India, you need to consider the following criteria: Consider your income and financial stabilityDetermine your credit scoreFigure out your repayment abilityMake use of online eligibility calculators\nQ: Who can be a co-applicant?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_22", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 14, "content": "gibility calculators\nQ: Who can be a co-applicant? A: A co-applicant can be any person who shares the financial obligation and accountability of the loan with the primary applicant while applying for a home loan in India. The co-applicant will be considered as an equal borrower and equally accountable for loan repayment. It can be the primary applicant's spouse, parents, children, siblings or other close family relatives who have a stable source of income\nQ: When does my loan repayment period begin?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_23", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 15, "content": "ncome\nQ: When does my loan repayment period begin? A: The repayment period for a home loan typically begins after the loan has been disbursed to you and/or the property purchasetransaction has been completed. This means that once you have received the funds and the ownership of the home has been transferred to you, your repayment obligations will start.The specific start date of your home loan repayment period should be outlined in the loan agreement you signed with the lender.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_24", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 16, "content": " in the loan agreement you signed with the lender. It's important to review your loan agreement to understand the terms and conditions, including the repayment start date, repayment schedule, interest rate, and any other relevant details pertaining to your specific loan. Q: For what purpose Can I take top up home loan ? A: Top-Loan on your home loan can be availed for various purposes such as repairs and renovations and other expenses such as weddings, education etc. Q: What is the interest rate of top up loan in BoM?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_25", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 17, "content": ": What is the interest rate of top up loan in BoM? A: ROI on Top -up loans for repair and renovation as well as for any other purpose will be 20bps higher than that applicable on the Maha Super Housing Loan Scheme (currently). Q: What are the benefits of home top up loan ? A: The benefits of a Home Top-Up Loan include access to additional funds for various purposes such as repairs and renovation, marriage and other related expenses at lower interest rates compared to personal loans.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_26", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 18, "content": "t lower interest rates compared to personal loans. Additionally, the repayment tenure on Top-Up loans is higher than that of personal loans. Q: How many times we can get top up home loan? A: There is no limit on the number of times you can avail of a Top-up loan on your home loan depending on fulfilling other terms and conditions as per the Top-Up Loan. However, only one top-up loan can be active at any given point in time. Q: What is eligibility for home loan in Bank of Maharashtra?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_27", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 19, "content": " eligibility for home loan in Bank of Maharashtra? A: For Resident Indians: Individual salaried employees (with a permanent job for a period of minimum 1-year continuous service) of State/ Central Government/ Public/ Private Sector Companies of repute, Self-Employed Professionals, and Businessmen.Non-resident Indians (NRIs) holding Indian Passport, Persons of Indian Origin (PICOs), and Overseas Citizens of India (OCI) are treated as NRIs: Salaried applicants/ co-applicant/s (whose income can be considered for eligibility), should have a regular job abroad i", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_28", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 20, "content": "r eligibility), should have a regular job abroad i n a reputed Indian/ Foreign Company, Organization or Government Department having a valid job contract/work permit for the minimum past 2 years.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_29", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 21, "content": "contract/work permit for the minimum past 2 years. Q: How can we apply for home loan? A: To apply for a Home Loan, one can either visit the nearest branch and complete all the required formalities or apply online through Bank of Maharashtra's website: bankofmaharashtra.bank.in\nQ: How much time does it take to sanction home loan? A: On average, loans are disbursed within 3-10 days after satisfactory completion of documentation and all the required procedures. Q: What is home loan interest rate at bank of maharashtra?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_30", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 22, "content": "is home loan interest rate at bank of maharashtra? A: Interest rates for Home Loans depend on a variety of factors such as Credit Score, amount of loan, profession etc. For more information on Interest rates on Home loans click on www.bankofmaharashtra.bank.in\nQ: How to get home loan for construction of house? A: To apply for a Home loan, you can apply online through our website (bankofmaharashtra.bank.in ) or can visit the nearest branch and complete all the required formalities. Q: what is the interest rate for home loan for womens?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_31", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 23, "content": "hat is the interest rate for home loan for womens? A: Yes, Home loan interest rates are lower for women than those applicable to others. The bank offers a 0.05% concession on home loans to women, subject to certain terms and conditions. Q: How much percentage interest for BoM home loan for womens? A: Interest rates for Home Loans depend on variety of factors such as credit score, amount of loan, profession etc. Additionally, Bank of Maharashtra offers a 0.05% concession on interest for women borrowers.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_32", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 24, "content": " 0.05% concession on interest for women borrowers. Q: What is bank of maharashtra home loan processing fee? A: The applicable processing fee is 0.25% of the loan amount plus applicable GST.Note: Processing Fees waiver for the period upto 31.12.2025\nQ: who can be co applicant for home loan? A: All co-owners of the property need to be co-applicants to the home loan. Generally, co-applicants are close family members. Q: How does home loan tenure affect your interest rate? A: No, Home loan tenure doesn't affect your interest rates.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_33", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 25, "content": "me loan tenure doesn't affect your interest rates. Interest rates on Bank of Maharashtra home loans are calculated based on the credit score of the applicant/s. Q: Is it compulsory to take home loan insurance? A: While not mandatory, the Bank strongly recommends considering Home Loan insurance. This insurance acts as a safety net, safeguarding your Home Loan in the event of unforeseen circumstances. Q: Is there any prepayment or foreclosure charges in home loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_34", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 26, "content": "ny prepayment or foreclosure charges in home loan? A: There are no Pre-Payment / Pre-Closure / Part-Payment Charges\nQ: What is the maximum tenure on Bank of Maharashtra home laon? A: The maximum tenure for Bank of Maharashtra Home Loan is up to 30 years or until the borrower reaches the age of 75 years, whichever is earlier.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_35", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 27, "content": "reaches the age of 75 years, whichever is earlier. --- Navigated to 'Purchase of New House/Flat' page ---\nURL: https://bankofmaharashtra.bank.in/maha-super-housing-loan-scheme-for-construction-acquiring\n--- Scheme Table ---\nS.No: 1\nParticulars: Purpose\nScheme guidelines:\nFor purchasing of new Residential unit (House, flat, Bungalow etc.) under construction /ready directly from the builders/ developers/society/other agencies/Development authority. For purchasing of old Residential unit (House, flat, Bungalow etc.).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_36", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 28, "content": "old Residential unit (House, flat, Bungalow etc.). Construction of a residential unit in owned Plot /Land. For extension (additional construction) in the existing house/flat\nTakeover of existing Housing Loan accounts of the applicants under standard category availed from other Banks / Housing Financial Institutions\n - For purchasing of new Residential unit (House, flat, Bungalow etc.) under construction /ready directly from the builders/ developers/society/other agencies/Development authority.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_37", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 29, "content": "pers/society/other agencies/Development authority. - For purchasing of old Residential unit (House, flat, Bungalow etc.). - Construction of a residential unit in owned Plot /Land. For extension (additional construction) in the existing house/flat\n - For extension (additional construction) in the existing house/flat\n - Takeover of existing Housing Loan accounts of the applicants under standard category availed from other Banks / Housing Financial Institutions\nS.No: 2\nParticulars: Eligibility\nScheme guidelines:\n1. Resident Indian Citizen  2.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_38", "original_file": "script_1.txt", "section_index": 6, "chunk_index": 30, "content": "\nScheme guidelines:\n1. Resident Indian Citizen  2. Non- Resident Indians (NRIs) or Persons of Indian Origin (PIOs) or Overseas Citizens of India\nS.No: 3\nParticulars: Eligible Quantum of Loan\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-6"}
{"chunk_id": "script_1_chunk_39", "original_file": "script_1.txt", "section_index": 7, "chunk_index": 0, "content": "Maximum loan amount will be lowest of loan amount assessed on the basis of", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-7"}
{"chunk_id": "script_1_chunk_40", "original_file": "script_1.txt", "section_index": 8, "chunk_index": 0, "content": "Maximum permissible LTV ratio\nLoan amount requested. - Permissible Deduction norms\n - Maximum permissible LTV ratio\n - Loan amount requested. S.No: 5\nParticulars: Moratorium Period\nScheme guidelines:\nMaximum 48 months. However interest may be capitalized for a maximum period of 18 months thereafter Interest to be serviced as and when applied\nS.No: 6\nParticulars: Repayment period\nScheme guidelines:\nMaximum Repayment period of 30 years or on borrower reaching the age of 75 years whichever is earlier.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-8"}
{"chunk_id": "script_1_chunk_41", "original_file": "script_1.txt", "section_index": 8, "chunk_index": 1, "content": "reaching the age of 75 years whichever is earlier. S.No: 7\nParticulars: Rate of Interest\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-8"}
{"chunk_id": "script_1_chunk_42", "original_file": "script_1.txt", "section_index": 9, "chunk_index": 0, "content": "Click here to view the Interest Rate\nS.No: 8\nParticulars: Deduction\nScheme guidelines:\nFor salaried individuals. Up to 80% based on latest monthly income\nFor Non-Salaried Individuals\nUp to 80% based on average annual income ​\nS.No: 9\nParticulars: Security\nScheme guidelines:\nEquitable / Registered Mortgage of Property. S.No: 10\nParticulars: Processing Fee\nScheme guidelines:\n0.25 % of the loan amount (Subject to max. of Rs. 25,000/-)\nFull waiver of Processing Fee for Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-9"}
{"chunk_id": "script_1_chunk_43", "original_file": "script_1.txt", "section_index": 9, "chunk_index": 1, "content": " 25,000/-)\nFull waiver of Processing Fee for Govt. /State /Central Government / Public sector Employees in case of Takeover Loans\nS.No: 11\nParticulars: Inclusion of cost of Solar Photo Lightening System /Rooftop Solar plant\nScheme guidelines:\nThe cost of rooftop Solar Photo Voltaic System / Rooftop Solar plant may be included in the project cost\nfor arriving at the Home Loan eligibility for purchase / Construction / Extension (additional construction) of residential units\nin respect of all applicants willing to install such system.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-9"}
{"chunk_id": "script_1_chunk_44", "original_file": "script_1.txt", "section_index": 9, "chunk_index": 2, "content": " of all applicants willing to install such system. The cost of consideration will be based upon the quotation received\nfrom the authorized dealers/agencies\n--- Navigated to 'Purchase of Plot and construction thereon' page ---\nURL: https://bankofmaharashtra.bank.in/maha-super-housing-loan-scheme-for-purchase-plot-construction-thereon\n--- Scheme Table (Purchase of Plot & construction thereon) ---\nS.No: 1\nParticulars: Purpose\nScheme guidelines:\nFor purchase of plot and construction thereon. S.No: 2\nParticulars: Eligibility\nScheme guidelines:\n1.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-9"}
{"chunk_id": "script_1_chunk_45", "original_file": "script_1.txt", "section_index": 9, "chunk_index": 3, "content": ": 2\nParticulars: Eligibility\nScheme guidelines:\n1. Resident Indian Citizen  2. Non- Resident Indians (NRIs) or Persons of Indian Origin (PIOs) or Overseas Citizens of India\nS.No: 3\nParticulars: Eligible Quantum of Loan\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-9"}
{"chunk_id": "script_1_chunk_46", "original_file": "script_1.txt", "section_index": 10, "chunk_index": 0, "content": "Maximum loan amount will be lowest of loan amount assessed on the basis of", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-10"}
{"chunk_id": "script_1_chunk_47", "original_file": "script_1.txt", "section_index": 11, "chunk_index": 0, "content": "Maximum permissible LTV ratio\nLoan amount requested.\n - Permissible Deduction norms\n - Maximum permissible LTV ratio\n - Loan amount requested.\nS.No: 5\nParticulars: Moratorium Period\nScheme guidelines:\nFor Purchase of Plot – No moratorium period for Plot loan\nFor construction of House - Maximum of 18 months from date of first disbursement.\nS.No: 6\nParticulars: Repayment period\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-11"}
{"chunk_id": "script_1_chunk_48", "original_file": "script_1.txt", "section_index": 12, "chunk_index": 0, "content": "Maximum Repayment period of 30 years or on borrower reaching the age of 75 years whichever is earlier\nS.No: 7\nParticulars: Rate of Interest\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-12"}
{"chunk_id": "script_1_chunk_49", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 0, "content": "Click here to view the Interest Rate\nS.No: 8\nParticulars: Deduction\nScheme guidelines:\nFor salaried individuals. Up to 80% based on latest monthly income\nFor Non-Salaried Individuals\n​Up to 80% based on average annual income\nS.No: 9\nParticulars: Security\nScheme guidelines:\nEquitable / Registered Mortgage of Property. S.No: 10\nParticulars: Processing Fee\nScheme guidelines:\n0.25 % of the loan amount (Subject to max. of Rs. 25,000/-)\nFull waiver of Processing Fee for Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_50", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 1, "content": " 25,000/-)\nFull waiver of Processing Fee for Govt. /State /Central Government / Public sector Employees in case of Takeover Loans\nS.No: 11\nParticulars: Inclusion of cost of Solar Photo Lightening System /Rooftop Solar plant\nScheme guidelines:\nThe cost of rooftop Solar Photo Voltaic System / Rooftop Solar plant may be included in the project cost for arriving at the Home Loan eligibility for purchase / Construction / Extension (additional construction) of residential units in respect of all applicants willing to install such system.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_51", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 2, "content": " of all applicants willing to install such system. The cost of consideration will be based upon the quotation received from the authorized dealers/agencies\n--- Navigated to 'Maha Super Housing Loan Scheme for repairs/renovation/alteration of existing house/flat.' page ---\nURL: https://bankofmaharashtra.bank.in/maha-super-housing-loan-scheme-for-repairs\n--- Scheme Table (Repairs/Renovation/Alteration) ---\nS.No: 1\nParticulars: Scheme Name\nScheme guidelines:\nMaha Super Housing Loan Scheme for repairs/renovation/alteration of existing house/flat.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_52", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 3, "content": "airs/renovation/alteration of existing house/flat. S.No: 2\nParticulars: Purpose\nScheme guidelines:\nFor Repair/renovation of an existing residential unit (fixed furnishing, immovable enhancements etc,) which add to the value of the residential unit, for existing and new borrower. S.No: 3\nParticulars: Eligibility\nScheme guidelines:\nA) For New borrower. Residential House should be unencumbered. Borrower should have obtained possession of the house property.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_53", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 4, "content": "ld have obtained possession of the house property. In case of takeover, loans under repair & renovation can be considered simultaneously along with takeover of housing loan. B) For existing Housing Loan Borrower. Construction of the property for which housing loan has been availed should be completed. Borrower should have obtained possession of the house property. Satisfactory repayment track record of last 6 months in existing Housing Loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_54", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 5, "content": " record of last 6 months in existing Housing Loan. Satisfactory repayment record means Housing Loan account should not have classified as SMA-1 or SMA-2 or NPA in last six months. 1. Residential House should be unencumbered. 2. Borrower should have obtained possession of the house property. 3. In case of takeover, loans under repair & renovation can be considered simultaneously along with takeover of housing loan. 1. Construction of the property for which housing loan has been availed should be completed. 3.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_55", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 6, "content": "sing loan has been availed should be completed. 3. Satisfactory repayment track record of last 6 months in existing Housing Loan. Satisfactory repayment record means Housing Loan account should not have classified as SMA-1 or SMA-2 or NPA in last six months. S.No: 4\nParticulars: Min. Annual Income\nScheme guidelines:\nFor Salaried:Rs.3.00lakh (last year income) - Minimum past 2 year ITR/Form 16 from the Employer is Mandatory.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_56", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 7, "content": "2 year ITR/Form 16 from the Employer is Mandatory. For Self-employed Professionals: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory. For Businessmen: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory. For Persons engaged in Agriculture & Allied activities having ascertainable Minimum income of Rs.3.00lakh. - For Salaried:Rs.3.00lakh (last year income) - Minimum past 2 year ITR/Form 16 from the Employer is Mandatory.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_57", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 8, "content": "2 year ITR/Form 16 from the Employer is Mandatory. - For Self-employed Professionals: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory. - For Businessmen: Rs.3.00lakh (as per last year ITR income) - Minimum past 2 year ITR with supporting documents are mandatory. - For Persons engaged in Agriculture & Allied activities having ascertainable Minimum income of Rs.3.00lakh.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_58", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 9, "content": "aving ascertainable Minimum income of Rs.3.00lakh. S.No: 5\nParticulars: Age\nScheme guidelines:\nMinimum: The applicant/s must be 21 years old (completed) as on the date of application. However, the minimum age of co-applicant/s can be 18 years. Maximum:\n65 Years for Professional working as self-employed i.e. for Doctors/Architects/CAs etc. and Businessman. 60 years for Salaried Individuals or Retirement age whichever is earlier. 70 Years for Pensioners\n - 65 Years for Professional working as self-employed i.e. for Doctors/Architects/CAs etc. and Businessman.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_59", "original_file": "script_1.txt", "section_index": 13, "chunk_index": 10, "content": ". for Doctors/Architects/CAs etc. and Businessman. - 60 years for Salaried Individuals or Retirement age whichever is earlier. - 70 Years for Pensioners\nS.No: 7\nParticulars: Deduction norms\nScheme guidelines:\nFor Salaried – Up to 80% on latest monthly salary\nFor Non Salaried -  Up to 80% on Average annual Income\nS.No: 8\nParticulars: Repayment\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-13"}
{"chunk_id": "script_1_chunk_60", "original_file": "script_1.txt", "section_index": 14, "chunk_index": 0, "content": "Maximum Repayment period of 20 Years\nNo Moratorium period is allowed. - Maximum Repayment period of 20 Years\n - No Moratorium period is allowed. S.No: 9\nParticulars: Security\nScheme guidelines:\nFor new borrower - Mortgage of the property to be repaired / renovated. Existing Housing loan borrower – Additional Mortgage of the property to be repaired / renovated. - For new borrower - Mortgage of the property to be repaired / renovated.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-14"}
{"chunk_id": "script_1_chunk_61", "original_file": "script_1.txt", "section_index": 14, "chunk_index": 1, "content": "rtgage of the property to be repaired / renovated. - Existing Housing loan borrower – Additional Mortgage of the property to be repaired / renovated. S.No: 10\nParticulars: Processing Fee & Other Charges\nScheme guidelines:\nProcessing Fee – 0.25% of sanctioned amount excluding GST (Min Rs.1000/- & Max Rs.25000/-)\nAccount Handling Charges – Rs 500/- + 0.10% of sanctioned amount excluding GST (Max Rs.11000/-)\nCharges will be applicable as per service charge booklet issued by Bank from time to time.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-14"}
{"chunk_id": "script_1_chunk_62", "original_file": "script_1.txt", "section_index": 14, "chunk_index": 2, "content": "e charge booklet issued by Bank from time to time. S.No: 12\nParticulars: Rate of Interest\nScheme guidelines:\nAs per Rate of Interest structure defined in Maha Super Housing Loan Scheme.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_1.txt-14"}
{"chunk_id": "script_10_chunk_0", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 0, "content": "--- Maha Bank Salary Gain Scheme Page ---\nTitle: Mahabank Salary Gain Scheme - Bank of Maharashtra\nURL: https://bankofmaharashtra.bank.in/salary-gain-scheme\n--- Salary Gain Scheme ---\nParticulars: Category\n For Govt. / State / PSUs employee: For Govt. / State /PSUs employee\n Other than Govt. / State / PSU employees: Other than Govt. / State /PSU employees\nParticulars: Purpose of loan\n For Govt. / State / PSUs employee: To meet their day to day needs. Other than Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_10_chunk_1", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 1, "content": ": To meet their day to day needs. Other than Govt. / State / PSU employees: To meet their day to day needs. Particulars: Facility\n For Govt. / State / PSUs employee: Overdraft\n Other than Govt. / State / PSU employees: Overdraft\nParticulars: Amount of OD\n For Govt. / State / PSUs employee: 5 times of monthly take home salary subject to Maximum Loan amount of Rs 5.00 Lakh\n Other than Govt. / State / PSU employees: 3 times of monthly take home salary subject to Maximum Loan amount of Rs 5.00 Lakh\nParticulars: Age\n For Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_10_chunk_2", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 2, "content": "amount of Rs 5.00 Lakh\nParticulars: Age\n For Govt. / State / PSUs employee: Minimum - 21 Years Maximum entry age should be three years before superannuation / retirement. Other than Govt. / State / PSU employees: Minimum - 21 Years Maximum entry age should be three years before superannuation / retirement. Particulars: Eligibility\n For Govt. / State / PSUs employee: The customer should be in permanent employment with total minimum 1 year of Service, with, Central Government / State Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_10_chunk_3", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 3, "content": "of Service, with, Central Government / State Govt. Department / undertakings (including Government and Government Aided Educational Institutions). Other than Govt. / State / PSU employees: The customer should be in permanent employment with total minimum 1 year of Service, Reputed Corporates/Public or Private  Limited Companies/MNCs * *For the employees of Pvt. / Public Ltd. Company, maintaining salary accounts with the Bank, Such companies should have external rating (in force) of A and above from any RBI accredited rating agency.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_10_chunk_4", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 4, "content": "A and above from any RBI accredited rating agency. Particulars: Minimum Take home salary\n For Govt. / State / PSUs employee: Minimum Take Home salary of the applicant should be Rs.25000/-p.m. Other than Govt. / State / PSU employees: Minimum Take Home salary of the applicant should be Rs.25000/-p.m. Particulars: Deduction Norms\n For Govt. / State / PSUs employee: Total deduction of the applicant including notional interest of the proposed OD facility should not exceed 65% of the Gross Monthly Salary. Other than Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_10_chunk_5", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 5, "content": " 65% of the Gross Monthly Salary. Other than Govt. / State / PSU employees: Total deduction of the applicant including notional interest of the proposed OD facility should not exceed 60% of the Gross Monthly Salary. Particulars: ROI\n For Govt. / State / PSUs employee: 1 Year RLLR + 3.15 %\n Other than Govt. / State / PSU employees: 1 Year RLLR + 3.15%\nParticulars: Processing Fee\n For Govt. / State / PSUs employee: 0.50% of the OD Amount per annum, subject to min. 500/- P.A\n Other than Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_10_chunk_6", "original_file": "script_10.txt", "section_index": 0, "chunk_index": 6, "content": "annum, subject to min. 500/- P.A\n Other than Govt. / State / PSU employees: 0.50% of the OD Amount per annum, subject to min. 500/- P.A", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_10.txt-0"}
{"chunk_id": "script_11_chunk_0", "original_file": "script_11.txt", "section_index": 0, "chunk_index": 0, "content": "--- Loan against Property –for Individuals(LAP) Page ---\nTitle: Personal Loan Against Property (LAP) - Bank of Maharashtra\nURL: https://bankofmaharashtra.bank.in/loan-against-property\n--- Loan against Property –for Individuals(LAP) ---\nS.No. | Particulars | Scheme guidelines\nParticulars: Name of the scheme\nScheme Guidelines: Loan against Property –for Individuals\nParticulars: Purpose of loan\nScheme Guidelines: To cater to the requirements of meeting personal expenses.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_11.txt-0"}
{"chunk_id": "script_11_chunk_1", "original_file": "script_11.txt", "section_index": 0, "chunk_index": 1, "content": " to the requirements of meeting personal expenses. Particulars: Eligibility\nScheme Guidelines: Permanent Employees of Central/ State Govt. /Public Sector Undertakings (PSUs) (including Schools/ Colleges/ Educational Institutions), and Individual Businessmen, professionals and Self-employed individuals who own residential property/ commercial property /or building in his/her own name which are unencumbered and under self-occupation. Particulars: Min Annual Income\nScheme Guidelines: Minimum annual Income – 5.00 Lakhs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_11.txt-0"}
{"chunk_id": "script_11_chunk_2", "original_file": "script_11.txt", "section_index": 0, "chunk_index": 2, "content": "me Guidelines: Minimum annual Income – 5.00 Lakhs. Particulars: Properties located at Metros\nScheme Guidelines: 10.00\nParticulars: Margin\nScheme Guidelines: For Loans up to Rs.1.00 Cr: 40% of the Realizable value of the property For Loans above Rs.1.00 Cr: 50% of the Realizable value of the property\nParticulars: Repayment Period\nScheme Guidelines: Maximum Repayment period of 10 years or on borrower reaching the age of 75 years whichever is earlier.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_11.txt-0"}
{"chunk_id": "script_11_chunk_3", "original_file": "script_11.txt", "section_index": 0, "chunk_index": 3, "content": "reaching the age of 75 years whichever is earlier. Particulars: Rate of Interest\nScheme Guidelines: Click here to view the Interest Rate\nParticulars: Deduction\nScheme Guidelines: Not to Exceed 60% of the Gross Income including Proposed EMI / Notional Interest. Particulars: Security\nScheme Guidelines: Mortgage of the Property\nParticulars: Processing Fee\nScheme Guidelines: 1 % of the loan amount + GST\n--- Apply Now ---\nLink: //digileads.bankofmaharashtra.bank.in/lgproperty?bom", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_11.txt-0"}
{"chunk_id": "script_12_chunk_0", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 0, "content": "--- Mahabank Aadhar Loan Scheme Page ---\nTitle: Mahabank Aadhar Loan Scheme - Bank of Maharashtra\nURL: https://bankofmaharashtra.bank.in/maha-adhaar-loan\n--- Mahabank Aadhar Loan Scheme ---\nS.No.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_1", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 1, "content": "aar-loan\n--- Mahabank Aadhar Loan Scheme ---\nS.No. | Particulars | Scheme guidelines\nSR No.: 1\nParticulars: Name of the scheme\nScheme Guidelines: Mahabank Aadhar Loan Scheme\nSR No.: 2\nParticulars: Purpose of loan\nScheme Guidelines: To meet personal expenses (General Consumption, Medical Expenses, Marriage Ceremony, Funerals, Birth, religious ceremonies, etc.)\nSR No.: 3\nParticulars: Eligibility\nScheme Guidelines: Central/ State Government/ Municipal Corporation/ PSUs and and Family Pensioners drawing pension from our branches\nSR No.: 4\nParticulars: Min Annua", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_2", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 2, "content": "from our branches\nSR No.: 4\nParticulars: Min Annua l Income\nScheme Guidelines: Not applicable\nSR No.: 5\nParticulars: Maximum Quantum of Finance\nScheme Guidelines: For General Pensioners: Equivalent to 18 months pension subject to maximum of 1.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_3", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 3, "content": "lent to 18 months pension subject to maximum of 1. Rs. 10.00 Lakhs up to age of 65 Yrs. 2. Rs. 5.00 Lakhs up to age of 70 Yrs. 3. Rs. 3.00 Lakhs up to age of 73 Yrs. For Defence & BOM Staff Pensioners: Equivalent to 36 months pension subject to maximum of 1. Rs.10.00 Lakhs up to age of 65 Yrs. 2. Rs. 7.00 Lakhs up to age of 70 Yrs. 3. Rs. 5.00 Lakhs up to age of 73 Yrs. For Family Pensioners of General, Bom staff & Defence Pensioner: Equivalent to 18 months pension subject to maximum of 1. Rs. 4.00 Lakhs up to age of 65 Yrs. 2. Rs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_4", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 4, "content": "m of 1. Rs. 4.00 Lakhs up to age of 65 Yrs. 2. Rs. 3.00 Lakhs up to age of 70 Yrs. 3. Rs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_5", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 5, "content": "3.00 Lakhs up to age of 70 Yrs. 3. Rs. 2.00 Lakhs up to age of 73 Yrs\nSR No.: 6\nParticulars: Margin\nScheme Guidelines: Nil\nSR No.: 7\nParticulars: Repayment Period\nScheme Guidelines: 120 EMI, Subject to 75 years of age at loan maturity\nSR No.: 8\nParticulars: Rate of Interest\nScheme Guidelines: Click here to view the Interest Rate\nSR No.: 9\nParticulars: Deduction\nScheme Guidelines: Pension upto Rs.12500/- => 40% of gross monthly pension Pension above Rs.12500/-=>50% of gross monthly pension\nSR No.: 10\nParticulars: Security\nScheme Guidelines: Famil", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_6", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 6, "content": " 10\nParticulars: Security\nScheme Guidelines: Famil y pension nominee will be taken as co-borrower (mandatory).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_7", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 7, "content": " nominee will be taken as co-borrower (mandatory). In case there is no beneficiary of family pension or family pensioner who availed Aadhar Loan, an acceptable guarantor having sufficient net worth and drawing salary/ pension from our branch be obtained.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_12_chunk_8", "original_file": "script_12.txt", "section_index": 0, "chunk_index": 8, "content": "awing salary/ pension from our branch be obtained. For Aadhar Loan to Family pensioner, one acceptable guarantor having sufficient net worth and drawing salary/ pension from our Bank be obtained\nSR No.: 11\nParticulars: Processing Fee\nScheme Guidelines: 0.50% of the loan amount subject to minimum of Rs.500/- & Maximum Rs 5000/ (exclusive of GST) No Processing Charges for Staff Pensioners.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_12.txt-0"}
{"chunk_id": "script_13_chunk_0", "original_file": "script_13.txt", "section_index": 0, "chunk_index": 0, "content": "--- Mahabank Green Financing Scheme Page ---\nTitle: Green loans - Apply now to avail green loans - Mahabank\nURL: https://bankofmaharashtra.bank.in/mahabank-green-financing-scheme\n--- Mahabank Green Financing Scheme ---\nGreen banking is a category of banking practices considering all the social and ecological factors with an aim to defend the environment and preserve natural resources. It is also called as ethical banking or sustainable banking.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_13.txt-0"}
{"chunk_id": "script_13_chunk_1", "original_file": "script_13.txt", "section_index": 0, "chunk_index": 1, "content": " called as ethical banking or sustainable banking. Seeing the importance of this across the globe, Bank has introduced Schemes namely 'Mahabank Green Financing Scheme', which includes following products for Retail borrowers. --- Mahabank Green Financing Scheme Types ---\n1. Maha Super Green Housing Loan Scheme\n- Green Building\nKnow More: /maha-super-green-housing-loan-scheme-green-building\n2. Maha Super Green Car Loan Scheme\n- Electric Car\nKnow More: /maha-super-green-car-loan-scheme-electric-car", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_13.txt-0"}
{"chunk_id": "script_14_chunk_0", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 0, "content": "--- Mahabank Rooftop Solar Panel Loan Scheme Page ---\nTitle: Mahabank Rooftop Solar Panel Loan scheme: PM Suryaghar\nURL: https://bankofmaharashtra.bank.in/mahabank-rooftop-solar-panel-loan\n--- Mahabank Rooftop Solar Panel Loan scheme ---\nS No.: 1\nParameter: Purpose\nEligibility Condition (Up to 3KW): Loan is provided for installation of Grid connected RTS (Roof Top Solar) upto 3 KW for residential purpose only.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_1", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 1, "content": "Top Solar) upto 3 KW for residential purpose only. Eligibility Condition (Above 3KW to 10KW): Loan is provided for installation of Grid connected RTS (Roof Top Solar) (Above 3 KW to 10 KW) for residential purpose only. ------------------------------------------------------------\nS No.: 2\nParameter: Eligibility\nEligibility Condition (Up to 3KW): \n - All Individual Applicants\n - Applicant having CIBIL Score of 680 & above (NTC also eligible)\n - Have Roof Top Rights on which the installation is proposed.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_2", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 2, "content": " Top Rights on which the installation is proposed. - Have sufficient Roof area as mandated by MNRE from time to time. - Latest Electricity Bill. - Savings Account with us mandatorily to be opened before availing of the loan\nEligibility Condition (Above 3KW to 10KW): \n - All Individual Applicants\n - Applicant having CIBIL Score of 680 & above (NTC also eligible)\n - Have Roof Top Rights on which the installation is proposed. - Have sufficient Roof area as mandated by MNRE from time to time. - Latest Electricity Bill.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_3", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 3, "content": "MNRE from time to time. - Latest Electricity Bill. - Savings Account with us mandatorily to be opened before availing of the loan\n------------------------------------------------------------\nS No.: 3\nParameter: Annual Income Criteria:-\nEligibility Condition (Up to 3KW): No Minimum Annual Income criteria. Eligibility Condition (Above 3KW to 10KW): Minimum Annual Income – Rs. 3.00 Lakh\n------------------------------------------------------------\nS No.: 4\nParameter: Minimum and Maximum Loan amount\nEligibility Condition (Up to 3KW): Minimum Limit: Rs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_4", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 4, "content": "gibility Condition (Up to 3KW): Minimum Limit: Rs. 10,000/-\nMaximum Limit: Rs 2.00 Lakh\nEligibility Condition (Above 3KW to 10KW): Minimum Limit: Rs. 10,000/-\nMaximum Limit: Rs 10.00 Lakh\n------------------------------------------------------------\nS No.: 5\nParameter: Margin\nEligibility Condition (Up to 3KW): Minimum Margin – 10% of project cost. (The project cost includes Design, Supply, Installation, testing & commissioning of Grid connected Rooftop Solar Photovoltaic Systems in residential premises including maintenance).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_5", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 5, "content": "ms in residential premises including maintenance). Eligibility Condition (Above 3KW to 10KW): Minimum Margin - 20% of project cost\n(The project cost includes Design, Supply, Installation, testing & commissioning of Grid connected Rooftop Solar Photovoltaic Systems in residential premises including maintenance).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_6", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 6, "content": "ms in residential premises including maintenance). ------------------------------------------------------------\nS No.: 6\nParameter: Age\nEligibility Condition (Up to 3KW): Minimum Age of applicant: -21 Years,\nMaximum -70- Years (Including repayment period)\nEligibility Condition (Above 3KW to 10KW): Minimum Age of applicant: -21 Years,\nMaximum -70- Years (Including repayment period)\n------------------------------------------------------------\nS No.: 7\nParameter: Subsidy\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n----------", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_7", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 7, "content": "ibility Condition (Above 3KW to 10KW): \n---------- --------------------------------------------------\nS No.: Rooftop Solar Plant Capacity\n(Up to 3KW)\nParameter: Rooftop Solar Plant Capacity\n(Up to 4KW to 10KW)\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: 1 KW – Rs 30000/-\n2 KW – Rs 60000/-\n3 KW – Rs 78000/-\nParameter: Subsidy Amount –Rs 78000/-\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n---------------------------------", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_8", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 8, "content": "e 3KW to 10KW): \n--------------------------------- ---------------------------\nS No.: 8\nParameter: Rate of Interest\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: Rate of Interest\nParameter: \nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: RLLR - 2.30%\nParameter: \nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n-----------------", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_9", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 9, "content": " Condition (Above 3KW to 10KW): \n----------------- -------------------------------------------\nS No.: CIBIL score\nParameter: Rate of Interest\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: 800 & above\nParameter: RLLR + 0.20%\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: 750 to 799\nParameter: RLLR + 0.50%\nEligibility Condition (Up to 3KW): \nEligibility Condit", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_10", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 10, "content": "ibility Condition (Up to 3KW): \nEligibility Condit ion (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: 700 to 749\nParameter: RLLR + 0.75%\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: 650 to 699\nParameter: RLLR + 1.00%\nEligibility Condition (Up to 3KW): \nEligibility Condition (Above 3KW to 10KW): \n------------------------------------------------------------\nS No.: 9\nParameter: Moratorium\nEligibility Condition (Up to", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_11", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 11, "content": "Parameter: Moratorium\nEligibility Condition (Up to  3KW): Upto 6 Months\nEligibility Condition (Above 3KW to 10KW): Upto 6 Months\n------------------------------------------------------------\nS No.: 10\nParameter: Loan repayment period\nEligibility Condition (Up to 3KW): 120 Months including moratorium\nEligibility Condition (Above 3KW to 10KW): 120 Months including moratorium\n------------------------------------------------------------\nS No.: 11\nParameter: Processing Fees\nEligibility Condition (Up to 3KW): Nil\nEligibility Condition (Above 3KW to 10KW): Nil\n----", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_12", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 12, "content": "ligibility Condition (Above 3KW to 10KW): Nil\n---- --------------------------------------------------------\nS No.: 12\nParameter: Account Handling Charges (Includes Documentation, Inspection/supervision, NeSL and CIBIL charges)\nEligibility Condition (Up to 3KW): Rs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_13", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 13, "content": "IL charges)\nEligibility Condition (Up to 3KW): Rs. 500 + 0.20 % of Loan amount\nMinimum Rs 500/-\nMaximum Rs 2500/-\nEligibility Condition (Above 3KW to 10KW): Rs. 500 + 0.20 % of Loan amount\nMinimum Rs 500/-\nMaximum Rs 2500/-\n------------------------------------------------------------\nS No.: 13\nParameter: Security\nEligibility Condition (Up to 3KW): Primary Security: - Hypothecation of Asset purchased i.e. Solar Roof top plant /setup. Registration of Hypothecation charges with CERSAI shall be done.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_14", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 14, "content": "f Hypothecation charges with CERSAI shall be done. Eligibility Condition (Above 3KW to 10KW): Primary Security: - Hypothecation of Asset purchased i.e. Solar Roof top plant /setup. Registration of Hypothecation charges with CERSAI shall be done. ------------------------------------------------------------\nS No.: 14\nParameter: Disbursement\nEligibility Condition (Up to 3KW): Disbursement to be made directly to the Vendor / EPC Contractor after submission of all the required feasibility reports as mandated by MNRE.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_15", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 15, "content": " required feasibility reports as mandated by MNRE. (Subsidy to be claimed by Borrower / Vendor quoting the Loan Account Number)\nEligibility Condition (Above 3KW to 10KW): Disbursement to be made directly to the Vendor / EPC Contractor after submission of all the required feasibility reports as mandated by MNRE.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_16", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 16, "content": " required feasibility reports as mandated by MNRE. (Subsidy to be claimed by Borrower / Vendor quoting the Loan Account Number)\n------------------------------------------------------------\nS No.: 15\nParameter: In Principal offer\nEligibility Condition (Up to 3KW): \n - Digital In-Principle Sanction to be given based on Self Declaration by the Applicant. Final Sanction to be based on verification of relevant documents and assessment by the Banks.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_17", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 17, "content": "of relevant documents and assessment by the Banks. - All applications will be sourced through Jan Samarth Portal Only Available for Self-Sourced Journey as well as assisted journey. Eligibility Condition (Above 3KW to 10KW): \n - Digital In-Principle Sanction to be given based on Self Declaration by the Applicant. Final Sanction to be based on verification of relevant documents and assessment by the Banks. - All applications will be sourced through Jan Samarth Portal Only Available for Self-Sourced Journey as well as assisted journey.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_18", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 18, "content": " Self-Sourced Journey as well as assisted journey. ------------------------------------------------------------\nS No.: 16\nParameter: Link for loan application\nEligibility Condition (Up to 3KW): To apply register at https://pmsuryaghar.gov.in\nClick here to Apply Digitally for Loan up to 2 Lakhs https://mahadigitalloans.bankofmaharashtra.bank.in/surya/#/home\nAfter successful registration, please apply at https://www.jansamarth.in→ Renewable energy → Apply now\nEligibility Condition (Above 3KW to 10KW): To apply register at https://pmsuryaghar.gov.in\nClick here", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_14_chunk_19", "original_file": "script_14.txt", "section_index": 0, "chunk_index": 19, "content": " register at https://pmsuryaghar.gov.in\nClick here  to Apply Digitally for Loan up to 2 Lakhs https://mahadigitalloans.bankofmaharashtra.bank.in/surya/#/home\nAfter successful registration, please apply at https://www.jansamarth.in→ Renewable energy → Apply now\n------------------------------------------------------------", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_14.txt-0"}
{"chunk_id": "script_15_chunk_0", "original_file": "script_15.txt", "section_index": 0, "chunk_index": 0, "content": "--- Loan Against Deposit (LAD) Page ---\nTitle: Loan Against Deposit (LAD)\nURL: https://bankofmaharashtra.in/lad\n--- Loan Against Deposit (LAD) ---\nApp Download Link: //bankofmaharashtra.bank.in/maha-mobile?lk=dc\nVideo Guide: //youtu.be/1i9C6MtTXTU?si=zD6EMDDtoO7ioD8J&rel=0&showinfo=0\nA Fixed Deposit (FD) is a reliable way to save and grow your wealth over time. However, financial emergencies can arise unexpectedly, and you may need immediate funds without disturbing your long-term financial goals.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_15.txt-0"}
{"chunk_id": "script_15_chunk_1", "original_file": "script_15.txt", "section_index": 0, "chunk_index": 1, "content": "without disturbing your long-term financial goals. That's why we offer a convenient Loan Against Deposit (LAD) facility, allowing you to leverage your existing Fixed Deposit (FD) for quick access to cash without the need to break it prematurely. Read below to explore the features, benefits, and how you can easily avail this facility using Bank of Maharashtra's mobile banking app.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_15.txt-0"}
{"chunk_id": "script_15_chunk_2", "original_file": "script_15.txt", "section_index": 0, "chunk_index": 2, "content": "ty using Bank of Maharashtra's mobile banking app. Getting a loan against your FD with Bank of Maharashtra is a straightforward process:\n--- Summary ---\nBank of Maharashtra's Loan Against Deposit offers a smart way to meet urgent financial needs and empowers you to access liquidity while preserving your long-term savings plan. With easy application, attractive interest rates, and the convenience of mobile banking, it's a win-win situation. Explore this option today and unlock financial flexibility! Click MAHAMOBILE to Download the app Now!", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_15.txt-0"}
{"chunk_id": "script_15_chunk_3", "original_file": "script_15.txt", "section_index": 0, "chunk_index": 3, "content": "ibility! Click MAHAMOBILE to Download the app Now! ------------------------------------------------------------", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_15.txt-0"}
{"chunk_id": "script_16_ROI_chunk_0", "original_file": "script_16_ROI.txt", "section_index": 0, "chunk_index": 0, "content": "--- Rate of Interest Retail Loans Page ---\nTitle: Rate of Interest Retail Loans\nURL: https://bankofmaharashtra.in/retail-interest-rates\nMain Heading: Rate of Interest Retail Loans\nDescription: Rate of Interest structure as mentioned bellow (RLLR-8.05%)\n--- Abbreviations ---\nAbbreviations:\nER: Effective Rate\nCIC: Credit Information Company\n------------------------------------------------------------", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_16_ROI.txt-0"}
{"chunk_id": "script_2_chunk_0", "original_file": "script_2.txt", "section_index": 0, "chunk_index": 0, "content": "Maha Super Flexi Housing Loan Scheme\nIn this Home loan scheme, the borrowers' account is linked to a dedicated savings account. So, when a borrower deposits the surplus money to the account, it will be considered credit towards the loan, thus reducing the interest on the outstanding loan amount. Also, if needed, the borrower has option to withdraw money whenever required. The loan will get rebalanced accordingly. --- Key Features ---\n- Home Loan sanctioned will be linked with flexi home Saving account.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-0"}
{"chunk_id": "script_2_chunk_1", "original_file": "script_2.txt", "section_index": 0, "chunk_index": 1, "content": "ned will be linked with flexi home Saving account. - Borrower will have the option to deposit all his savings in the linked flexi home Saving account to avail maximum benefit of interest. - Credit Balance available in the linked flexi home Saving account at the end of the day will be counted for credit in linked Home Loan account. - Accordingly, the borrower will get the benefit of interest amount in the Home Loan to the extent of daily outstanding credit balance in the linked flexi home Saving Account Bank account.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-0"}
{"chunk_id": "script_2_chunk_2", "original_file": "script_2.txt", "section_index": 0, "chunk_index": 2, "content": "the linked flexi home Saving Account Bank account. - Borrower is eligible for Cheque book facility, internet banking facility, and Mobile banking facility etc. as per normal Savings Bank rules. --- Benefits to the borrowers ---\n- The surplus amount deposited could be utilized for his personal / business purpose whenever required. - The scheme offers liquidity as well as interest relief. --- Scheme Table ---\nS.No: 1\nParticulars: Nature of facility\nScheme guidelines:\nTerm Loan linked with Saving Account.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-0"}
{"chunk_id": "script_2_chunk_3", "original_file": "script_2.txt", "section_index": 0, "chunk_index": 3, "content": " guidelines:\nTerm Loan linked with Saving Account. S.No: 2\nParticulars: Purpose\nScheme guidelines:\n - For Purchase of ready built residential flat directly from the Builders/ Developers/Society/Other Agencies/Development Authority / etc. - For Purchase of new or existing house/flat not older than 30 years (Residual life of the building should be 5 Years more than the loan tenure at the time of sanction).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-0"}
{"chunk_id": "script_2_chunk_4", "original_file": "script_2.txt", "section_index": 0, "chunk_index": 4, "content": "ore than the loan tenure at the time of sanction). - Takeover of existing Housing Loan accounts of the applicants under standard category availed from other Banks / Housing Financial Institutions\nS.No: 3\nParticulars: Eligibility\nScheme guidelines:\nIndividual salaried employees/ self-employed professionals/Businessman / Agriculturist\nS.No: 4\nParticulars: Eligible Quantum of Loan\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-0"}
{"chunk_id": "script_2_chunk_5", "original_file": "script_2.txt", "section_index": 1, "chunk_index": 0, "content": "Maximum loan amount will be lowest of loan amount assessed on the basis of\n - Permissible Deduction norms\n - Maximum permissible LTV ratio\n - Loan amount requested. S.No: 5\nParticulars: Loan Amount\nScheme guidelines:\nMinimum - Rs 50.00 Lakh\nMaximum - No Maximum Limit\nS.No: 7\nParticulars: Repayment period\nScheme guidelines:\nMaximum Repayment period of 30 years or on borrower reaching the age of 75 years whichever is earlier.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-1"}
{"chunk_id": "script_2_chunk_6", "original_file": "script_2.txt", "section_index": 1, "chunk_index": 1, "content": "reaching the age of 75 years whichever is earlier. S.No: 8\nParticulars: Rate of Interest\nScheme guidelines:\nAdditional 0.25% above the existing ROI as per \" Maha Super Housing Loan scheme\" will be applicable. S.No: 9\nParticulars: Deduction\nScheme guidelines:\nFor Salaried individuals. Up to 80% based on latest Gross monthly income\nFor Non-Salaried Individuals\nUp to 80% based on average annual income\nS.No: 10\nParticulars: Flexi Credit Arrangement\nScheme guidelines:\n - The Home Loan sanctioned will be linked with flexi home Saving account.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-1"}
{"chunk_id": "script_2_chunk_7", "original_file": "script_2.txt", "section_index": 1, "chunk_index": 2, "content": "ned will be linked with flexi home Saving account. - The rate of interest applicable on this flexi home Saving account will be Zero\n - After full disbursement of Loan and other condition of loan gets completed, Borrower will be permitted to deposit surplus funds over and above stipulated EMIs in the Flexi SB account and also allowed to withdraw the surplus amount deposited in the account. - Any credit available in the linked Flexi home Saving account at the end of the day will be counted for credit in linked Home Loan account.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-1"}
{"chunk_id": "script_2_chunk_8", "original_file": "script_2.txt", "section_index": 1, "chunk_index": 3, "content": "be counted for credit in linked Home Loan account. The outstanding balance of Home Loan account and linked savings SB account will be netted on day end. Accordingly, interest will be charged to the Home Loan account netting credit balance available in the Flexi home Saving Account Bank account. - The per day interest calculation done in EOD in Flexi Home Loan account should be on Balance O/s of Loan Account less Credit Balance in linked Flexi Home SB account. S.No: 11\nParticulars: Security\nScheme guidelines:\nEquitable / Registered Mortgage of Property.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-1"}
{"chunk_id": "script_2_chunk_9", "original_file": "script_2.txt", "section_index": 1, "chunk_index": 4, "content": "ines:\nEquitable / Registered Mortgage of Property. S.No: 12\nParticulars: Processing Fee\nScheme guidelines:\n0.25 % of the loan amount (Subject to max. of Rs. 25,000/-)\n(currently waived up to 30.09.2024)\nFull waiver of Processing Fee for Govt. /State /Central Government / Public sector Employees in case of Takeover Loans", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_2.txt-1"}
{"chunk_id": "script_3_chunk_0", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 0, "content": "--- Title ---\nPradhan Mantri Awas Yojana – Urban 2.0 (Interest Subsidy Scheme)\n--- Table 1: Scheme Details ---\nS.No: 1\nParticulars: Objective\nDetails:\nProvide affordable housing to urban under Economically weaker section (EWS), Low Income group (LIG), and Mid Income Group (MIG) categories)\nS.No: 2\nParticulars: Annual Household Income\nDetails:\nEWS :-   Up to ₹3 lakh\nLIG :-     Up to ₹6 lakh\nMIG :-    Up to ₹9 lakh\nFor identification as an EWS/LIG/MIG beneficiary under the Scheme, an individual loan applicant", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_1", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 1, "content": "ary under the Scheme, an individual loan applicant  will submit self-certificate/affidavit as proof of income.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_2", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 2, "content": "mit self-certificate/affidavit as proof of income. S.No: 3\nParticulars: Loan property limits\nDetails:\nMaximum Loan : Rs 25.00 Lakh\nMaximum Housing Value : Rs 35.00 Lakh\nMaximum Carpet Area : 120 Sqm\nS.No: 4\nParticulars: House Ownership\nDetails:\n - Applicants must not owning a pucca house anywhere in India on his/her name or any other family members. ( An undertaking from the beneficiary will be taken as a declaration)\nS.No: 5\nParticulars: Key conditions\nDetails:\n - Adhaar requirement: - Mandatory for all beneficiaries.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_3", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 3, "content": "ar requirement: - Mandatory for all beneficiaries. - Self-Undertaking: - Required as per the format\n - Registration: -Beneficiaries must register their demand through a Unified web-portal. S.No: 6\nParticulars: Subsidy Details\nDetails:\n - A maximum release of interest subsidy of ₹1.80 lakh having maximum NPV of ₹1.50 lakh (at Discount Rate of 8.5%) shall be provided to eligible beneficiaries having a loan tenure of more than five years.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_4", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 4, "content": "ries having a loan tenure of more than five years. - Households having income up to ₹9 lakh, loan value up to ₹25 lakh for property value up to ₹35 lakh would be eligible for a subsidy at 4.0 % on first ₹8 lakh for a tenure up to 12 years. - Subsidy to the beneficiaries will be released in 5 equal yearly instalments. S.No: 7\nParticulars: Approved layout plans\nDetails:\nThe subsidy will be provided to those beneficiaries who have submitted the approved layout plan to the Banks as per guidelines of States/UTs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_5", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 5, "content": "plan to the Banks as per guidelines of States/UTs. However, the layout plan may not be insisted by Banks where States/UTs have provided the exemption for construction of houses having provision of deemed approval or pre-approved building plan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_6", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 6, "content": " of deemed approval or pre-approved building plan. --- Table 2: Eligibility Criteria ---\nCriteria: Annual Household Income (₹)\n EWS: Up to ₹3 lakh\n LIG: ₹3 lakh - ₹6 lakh\n MIG: ₹6 lakh - ₹9 lakh\nCriteria: Interest Subsidy (% P.A.)\n EWS: 4% on the first ₹8 lakh of the loan\n LIG: 4% on the first ₹8 lakh of the loan\n MIG: 4% on the first ₹8 lakh of the loan\nCriteria: Maximum Home Loan Eligible (₹)\n EWS: ₹25 lakh\n LIG: ₹25 lakh\n MIG: ₹25 lakh\nCriteria: Maximum House Value (₹)\n EWS: ₹35 lakh\n LIG: ₹35 lakh\n MIG: ₹35 lakh\nCriteria: Maximum Carpet Area(sqm)\n EWS: ", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_3_chunk_7", "original_file": "script_3.txt", "section_index": 0, "chunk_index": 7, "content": "₹35 lakh\nCriteria: Maximum Carpet Area(sqm)\n EWS:  120 sqm\n LIG: 120 sqm\n MIG: 120 sqm\nCriteria: Maximum Benefit of Interest Subsidy (₹)\n EWS: ₹1.80 lakh\n LIG: ₹1.80 lakh\n MIG: ₹1.80 lakh\nCriteria: Current Home Ownership\n EWS: NO\n LIG: NO\n MIG: NO\nProperty Location | Statutory towns as per Census 2011 or any town subsequently notified by the government\n--- Steps to Apply not found ---", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_3.txt-0"}
{"chunk_id": "script_4_chunk_0", "original_file": "script_4.txt", "section_index": 0, "chunk_index": 0, "content": "For more details Click here\n--- Interest Rate Box ---\nInterest Rate: 7.45 %P.A*\n--- Features & Benefits ---\n- Low EMI\n- Higher Loan Amount\n- Track my Loan\n- Approved Car Dealers\n- Simplified Disbursement\n- No Processing Fee\n- No Hidden Charges\n- No Prepayment Penalty\n* 0.25 % Concession in ROI for Corporate salary account Holder and Existing Housing Loan borrower\n* Maximum Funding 90%\n* Interest charged on daily reducing Balance\n* No Pre-Payment / Pre-closure / Part payment Charges\n* Quick turnaround time\n-", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-0"}
{"chunk_id": "script_4_chunk_1", "original_file": "script_4.txt", "section_index": 0, "chunk_index": 1, "content": "e / Part payment Charges\n* Quick turnaround time\n- -- Documents Required ---\n- Two Passport Size Photographs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-0"}
{"chunk_id": "script_4_chunk_2", "original_file": "script_4.txt", "section_index": 0, "chunk_index": 2, "content": "ents Required ---\n- Two Passport Size Photographs. - Proof of Identification: (any one)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-0"}
{"chunk_id": "script_4_chunk_3", "original_file": "script_4.txt", "section_index": 1, "chunk_index": 0, "content": "Passport\n- For Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. Undertaking from employer for remittance of monthly installment, wherever feasible.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-1"}
{"chunk_id": "script_4_chunk_4", "original_file": "script_4.txt", "section_index": 1, "chunk_index": 1, "content": "ittance of monthly installment, wherever feasible. Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n- For Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-1"}
{"chunk_id": "script_4_chunk_5", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 0, "content": "Bank statement for past one year\n- Other documents as applicable as per scheme of loan\n--- Interest Rates ---\nCar Loan Interest Rate: 7.45 %P.A*\n--- EMI Calculator ---\nMonthly Payment (EMI): Rs. 2001\nTotal Interest: Rs. 20085\nTotal Repayment: Rs. 120085\n--- Eligibility ---\nHow will Bank of Maharashtra decide the car loan amount i am eligible for? --- How to Apply ---\nFollow the step by step instructions to avail digital loan facility from our bank. --- FAQs ---\nQ: What is a Car loan and how does it work?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_6", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 1, "content": "Qs ---\nQ: What is a Car loan and how does it work? A: Maha Super Car Loan is for purchase of new four-wheeler i.e.Car, Jeep , Multi Utility vehicles (MUV)\nQ: How to get your Car Loan Approved Faster? A: A critical factor in getting a loan approved fast is determining how much EMI you are comfortable paying. Use our Car Loan EMI calculator to estimate how much you will need to set aside.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_7", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 2, "content": "r to estimate how much you will need to set aside. These will enable you to plan and prepare for the Car Loan application process.To make sure your Car Loan is approved faster; the key is to provide all the necessary documents and complete your Know your Customer (KYC) formalities. Q: How can I know what my EMI amount is? A: You can use the EMI Calculator to know your EMI amount before applying for the Loan. Q: What are the minimum and maximum tenures of a Car Loan? A: Bank of Maharashtra offers flexible tenures on their Car Loan products.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_8", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 3, "content": "ffers flexible tenures on their Car Loan products. The maximum tenure is 84 months. Q: How much Car Loan can I get on my salary? A: Car Loan is usually give upto 36 times of net monthly salary and 90% of the cost of car value depending on the repaying capacity such that the overall deuctions does not exceed 65% of Gross Income (including proposed EMI).For example: A person having gross monthly salary of Rs. 40000 and deduction of Rs. 5000 making his net monthly salary of Rs. 35000 is eligible for car loan of Rs. 1260000\nQ: What is a Vehicle loan Agreement?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_9", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 4, "content": "f Rs. 1260000\nQ: What is a Vehicle loan Agreement? A: Vehicle loan agreement is an agreement containing important clauses executed between lender and borrower/coborrower/guarantor for grant of loan for purchase of a vehicle. Q: What is car loan interest rate in Bank of Maharashtra? A: Interest rates for Car loan at Bank of Maharashtra are based on the Repo Linked Lending Rate (RLLR) and Credit Score of the customer. Currently it starts from 7.45% - 12.00%. Q: How is EMI calculated on car loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_10", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 5, "content": "5% - 12.00%. Q: How is EMI calculated on car loan? A: EMIs are calculated based on the loan amount, interest rate and loan tenure. To calculate your EMI, you can use the EMI Calculator. Q: What is Bank of Maharashtra commercial car loan interest rate? A: Interest rate for Commercial Car Loan is based on a variety of factors such as credit score, credit rating, collateral offered, amount of loan etc. Q: How do I calculate my interest rate or EMI on a car loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_4_chunk_11", "original_file": "script_4.txt", "section_index": 2, "chunk_index": 6, "content": "I calculate my interest rate or EMI on a car loan? A: Interest rates for car loan are based on the Repo Linked Lending Rate (RLLR) and Credit Score of the customer starting from 7.45% - 12.00%. Q: Is there any pre-payment or fore closure charges in vehicle loan? A: There are No Pre-Payment / Pre-Closure / Part-Payment Charges. Q: What is the maximum tenure on Bank of Maharashtra Vehicle laon? A: The maximum tenure is 84 months.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_4.txt-2"}
{"chunk_id": "script_5_chunk_0", "original_file": "script_5.txt", "section_index": 0, "chunk_index": 0, "content": "Maximum loan amount will be assessed on the basis of Permissible Deduction norms", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_5.txt-0"}
{"chunk_id": "script_5_chunk_1", "original_file": "script_5.txt", "section_index": 1, "chunk_index": 0, "content": "Maximum Loan amount\nTwo Wheeler (including E vehicle)\nHigh End Two wheeler -  2 wheelers (Super Bike)\n - Minimum Loan amount: -  Rs 50000/-\n - Maximum Loan amount: -  Rs 5.00 Lakh\n - Minimum Loan Amount- Rs 5.00 Lakh\n - Maximum Loan amount- Rs.25.00 Lakh\nS.No: 6\nParticulars: Margin\nScheme guidelines:\nMinimum 15% of On Road price of Vehicle. On Road price shall include Ex Show Room Price, Road Tax, Cost of Registration and Insurance (One Year or Three Years), excluding cost of accessories.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_5.txt-1"}
{"chunk_id": "script_5_chunk_2", "original_file": "script_5.txt", "section_index": 1, "chunk_index": 1, "content": "ar or Three Years), excluding cost of accessories. S.No: 7\nParticulars: Repayment Period\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_5.txt-1"}
{"chunk_id": "script_5_chunk_3", "original_file": "script_5.txt", "section_index": 2, "chunk_index": 0, "content": "Maximum 60 months\nS.No: 8\nParticulars: Rate of Interest\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_5.txt-2"}
{"chunk_id": "script_5_chunk_4", "original_file": "script_5.txt", "section_index": 3, "chunk_index": 0, "content": "Click here to view the Interest Rate\nS.No: 9\nParticulars: Deduction\nScheme guidelines:\nTotal deductions including proposed EMI up to 65 % of Gross Monthly Income (salaried) / Gross Average Annual Income (Non salaried)\nS.No: 10\nParticulars: Security\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_5.txt-3"}
{"chunk_id": "script_5_chunk_5", "original_file": "script_5.txt", "section_index": 4, "chunk_index": 0, "content": "Hypothecation of vehicle purchased\nS.No: 11\nParticulars: Processing Fee\nScheme guidelines:\n0.50% of Loan Amount\nMin: Rs. 500/- ; Max: Rs. 5000/-", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_5.txt-4"}
{"chunk_id": "script_6_chunk_0", "original_file": "script_6.txt", "section_index": 0, "chunk_index": 0, "content": "Mahabank Vehicle Loan Scheme for Purchase of Second Hand Car\n(Pre owned Cars)\nWe have finance schemes that translate your dreams into reality. S.No. --- Scheme Table ---\nS.No: 1\nParticulars: Name of the scheme\nScheme guidelines:\nMahabank Vehicle Loan Scheme: For Purchasing Second Hand Car (Pre owned Cars)\nS.No: 3\nParticulars: Eligibility\nScheme guidelines:\n - Confirmed Salaried Employees of Central Govt. / State Govt. / Public Sector Undertakings/ Govt.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-0"}
{"chunk_id": "script_6_chunk_1", "original_file": "script_6.txt", "section_index": 0, "chunk_index": 1, "content": " / State Govt. / Public Sector Undertakings/ Govt. aided Educational Institute / Private / Public Limited Company /etc. with continuous service for minimum 1 year is required. - Pensioners of Central/ State Government/ PSU having minimum pension of Rs.25000/- per month. - Self Employed Professionals includes CAs, Doctors, Architects, Company Secretaries, Advocates, CMAs etc. with their own practicing. - Businessman/ Independent Entrepreneurs who have regular source of income.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-0"}
{"chunk_id": "script_6_chunk_2", "original_file": "script_6.txt", "section_index": 0, "chunk_index": 2, "content": "t Entrepreneurs who have regular source of income. - Farmers having land holding engaged in production oriented agricultural activities and in other allied activities. S.No: 4\nParticulars: Min Annual Income\nScheme guidelines:\n - For Salaried: Rs. 3.00 lakh (last year income) - Minimum past 2 years ITR/Form 16 from the Employer is required. - For Other Individuals: Rs.3.00 lakh (last year income) – Minimum past 2 years ITR with supporting documents are required.. S.No: 5\nParticulars: Eligible Loan Amount\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-0"}
{"chunk_id": "script_6_chunk_3", "original_file": "script_6.txt", "section_index": 1, "chunk_index": 0, "content": "Maximum loan amount will be assessed on the basis of Permissible Deduction norms\nMinimum – Rs 2.00 Lakhs\nMaximum – Rs 50.00 Lakhs\nMaximum Quantum of Loan will be Lowest of the following. 70 % of latest Market value as per valuation certificate issued by certified pre-owned car Dealer / 70% of invoice value from showroom of authorized dealers. Or\n100% of Insured Declared Value (IDV) as per Motor Insurance Policy.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-1"}
{"chunk_id": "script_6_chunk_4", "original_file": "script_6.txt", "section_index": 1, "chunk_index": 1, "content": "eclared Value (IDV) as per Motor Insurance Policy. S.No: 6\nParticulars: Margin\nScheme guidelines:\nMinimum 30 % of the lasts Market value as per valuation certificate issued by certified pre-owned car Dealer or 30% of invoice value from showroom of authorized dealers. S.No: 7\nParticulars: Repayment Period\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-1"}
{"chunk_id": "script_6_chunk_5", "original_file": "script_6.txt", "section_index": 2, "chunk_index": 0, "content": "Maximum 60 months\nS.No: 8\nParticulars: Rate of Interest\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-2"}
{"chunk_id": "script_6_chunk_6", "original_file": "script_6.txt", "section_index": 3, "chunk_index": 0, "content": "Click here to view the Interest Rate\nS.No: 9\nParticulars: Deduction\nScheme guidelines:\nTotal deductions including proposed EMI should not exceed 65 % of Gross Monthly Income (salaried) / Gross Average Annual Income (Non salaried)\nS.No: 10\nParticulars: Security\nScheme guidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-3"}
{"chunk_id": "script_6_chunk_7", "original_file": "script_6.txt", "section_index": 4, "chunk_index": 0, "content": "Hypothecation of vehicle purchased\nS.No: 11\nParticulars: Processing Fee\nScheme guidelines:\n0.50% of Loan Amount\nMin: Rs. 500/-", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_6.txt-4"}
{"chunk_id": "script_7_chunk_0", "original_file": "script_7.txt", "section_index": 0, "chunk_index": 0, "content": "Last 6 months salary account statements\n * Last 2 years ITR (if Taxable Income) & Form 16\n * Last 3 months salary slips\n * Last 6 months salary account statements\n- Documents of Businessman / self employed", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-0"}
{"chunk_id": "script_7_chunk_1", "original_file": "script_7.txt", "section_index": 1, "chunk_index": 0, "content": "Last 2 years ITR\nLast 2 years audited balance sheets & Profit loss statements along with computation of income", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-1"}
{"chunk_id": "script_7_chunk_2", "original_file": "script_7.txt", "section_index": 2, "chunk_index": 0, "content": "Last 12 months business bank account statement\nTax paid challan/26AS\nBusiness Proof - Properitor - shop act / Gramapanchayath certificate\nFor Agriculturist - Those who do not file Income Tax Returns, income certificate issued by Tahasildar, 8A & all 7/12 extract along with supporting income proofs", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-2"}
{"chunk_id": "script_7_chunk_3", "original_file": "script_7.txt", "section_index": 3, "chunk_index": 0, "content": "Tahasildar income certificate for interest subvention claim\n * Last 2 years ITR\n * Last 2 years audited balance sheets & Profit loss statements along with computation of income\n * Last 12 months business bank account statement\n * Tax paid challan/26AS\n * Business Proof - Properitor - shop act / Gramapanchayath certificate\n * For Agriculturist - Those who do not file Income Tax Returns, income certificate issued by Tahasildar, 8A & all 7/12 extract along with supporting income proofs", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-3"}
{"chunk_id": "script_7_chunk_4", "original_file": "script_7.txt", "section_index": 4, "chunk_index": 0, "content": "Tahasildar income certificate for interest subvention claim\n- Other documents related to academics\n10th std mark sheet\n12th std mark sheet\nDiploma/Degree mark sheet of all semesters\nRequisite exam scorecard /proof of obtaining seat in merit based selection process(DTE/JEE score card studies in India, GRE/TOEFL score card studying abroad or equivalent requisite exam score card)\nConfirmation letter from institute with free structure or I-20(studying abroad)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-4"}
{"chunk_id": "script_7_chunk_5", "original_file": "script_7.txt", "section_index": 5, "chunk_index": 0, "content": "Receipts of fees paid already\nQuotation of the laptop (fee structure of college to specially mention the requirement of course)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-5"}
{"chunk_id": "script_7_chunk_6", "original_file": "script_7.txt", "section_index": 6, "chunk_index": 0, "content": "If student has taken gap during academic year affidavit for gap\nDeclaration of source of margin money if applicable. Declaration of job opportunities, expected salary after getting job. Declaration for option of repayment of interest during moratorium period. If plot/house/flat is offered as security - Latest search & valuation report & all property related documents as per housing loan checklist\nIf takeover from other bank/institution, sanction letter with statement of account .", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-6"}
{"chunk_id": "script_7_chunk_7", "original_file": "script_7.txt", "section_index": 6, "chunk_index": 1, "content": "ution, sanction letter with statement of account . * 10th std mark sheet\n * 12th std mark sheet\n * Diploma/Degree mark sheet of all semesters\n * Requisite exam scorecard /proof of obtaining seat in merit based selection process(DTE/JEE score card studies in India, GRE/TOEFL score card studying abroad or equivalent requisite exam score card)\n * Confirmation letter from institute with free structure or I-20(studying abroad)\n * Receipts of fees paid already\n * Quotation of the laptop (fee structure of college to specially mention the requirement of course)\n * ", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-6"}
{"chunk_id": "script_7_chunk_8", "original_file": "script_7.txt", "section_index": 6, "chunk_index": 2, "content": "o specially mention the requirement of course)\n *  If student has taken gap during academic year affidavit for gap\n * Declaration of source of margin money if applicable.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-6"}
{"chunk_id": "script_7_chunk_9", "original_file": "script_7.txt", "section_index": 6, "chunk_index": 3, "content": "claration of source of margin money if applicable. * Declaration of job opportunities, expected salary after getting job. * Declaration for option of repayment of interest during moratorium period. * If plot/house/flat is offered as security - Latest search & valuation report & all property related documents as per housing loan checklist\n * If takeover from other bank/institution, sanction letter with statement of account . --- Interest Rates ---\nEducation Loan Interest Rate: 6.85 %P.A *\n--- EMI Calculator ---\nMonthly Payment (EMI): Rs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-6"}
{"chunk_id": "script_7_chunk_10", "original_file": "script_7.txt", "section_index": 6, "chunk_index": 4, "content": "\n--- EMI Calculator ---\nMonthly Payment (EMI): Rs. 981.96\nTotal Interest: Rs. 66478\nTotal Repayment: Rs. 176753\n--- Subsidies Scheme ---", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-6"}
{"chunk_id": "script_7_chunk_11", "original_file": "script_7.txt", "section_index": 7, "chunk_index": 0, "content": "Educational Subsidies Scheme\nBank of Maharashtra provides Interest subsidies scheme for Education Loans, such as\n1) CENTRAL SECTOR INTEREST SUBSIDY SCHEME\n2) PADHO PARDESH - SCHEME OF INTEREST SUBSIDY ON EDUCATIONAL LOANS FOR OVERSEAS STUDIES FOR THE STUDENTS BELONGING TO THE MINORITY COMMUNITIES.\n3) DR. AMBEDKAR CENTRAL SECTOR SCHEME OF INTEREST SUBSIDY ON EDUCATIONAL LOANS FOR OVERSEAS STUDIES FOR OTHER BACKWARD CLASSES (OBCs) AND ECONOMICALLY BACKWARD CLASSES (EBCs)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-7"}
{"chunk_id": "script_7_chunk_12", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 0, "content": "Click here to Know More about the Subsidies\n--- FAQs ---\nQ: What is Education Loan and how does it work? A: Education Loan is meant to provide financial assistance/ support to meritorious student for pursuing higher studies /education in courses conducted by the Premier Educational Institutions in India such as IIMs, ISB, IITs, NITs, XLRI, MBBS, Medical College etc.Apart from these, Education Loans are also provided for Graduation courses/Colleges under Universities approved by UGC.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_13", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 1, "content": "urses/Colleges under Universities approved by UGC. Other courses leading to diploma / degree etc. conducted by colleges / universities approved by UGC / Govt. / AICTE / AIBMS / ICMR etc. in India.For Studies Abroad, Education Loan is provided for Job oriented Professional/Technical / PG courses/ Post Graduation - MCA, MBA, MS etc. Q: What are the variants of Education Loans provided by Bank of Maharashtra?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_14", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 2, "content": "f Education Loans provided by Bank of Maharashtra? A: Bank of Maharashtra provides three variants of Education Loans as under:Maha Scholar Education Loan –Loan for pursuing higher studies in Premier Institutions in IndiaModel Education Loan- Loan for pursuing higher studies in India and abroad for recognized universitiesMahabank Skill Loan- Loan for Skill development coursesMaha Scholar Overseas Education loan- Loans is granted to deserving/meritorious students for pursuing full-time regular courses in premier foreign colleges/universities\nQ: Who can apply ", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_15", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 3, "content": "er foreign colleges/universities\nQ: Who can apply  for Bank of Maharashtra Education Loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_16", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 4, "content": "for Bank of Maharashtra Education Loan? A: Eligible applicants include students seeking education at recognized institutions, both in India and abroad. The loan is open to Indian nationals with a secured admission offer. Q: What are the documents required for Education Loan? A: You will need to furnish the following documents along with the completed application form.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_17", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 5, "content": "cuments along with the completed application form. When the loan is jointly taken, relevant information would relate to the guardian and the student both.Mark sheet of last qualifying examination for school and graduate studies in IndiaProof of admission to the courseSchedule of expenses for the course2 passport size photographsStatement of Bank account for the last six months of borrowerIncome tax assessment order not more than 2 years oldBrief statement of assets and liabilities of borrower.For more details, please check \"Document Required\" sectionIf you ", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_18", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 6, "content": "s, please check \"Document Required\" sectionIf you  are not an existing bank customer you would also need to establish your identity and give proof of residence.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_19", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 7, "content": "tablish your identity and give proof of residence. Q: Who can be a co-applicant in Education Loan? A: Co-applicant should be parent/natural guardian of the student borrower. In case of married person, co-obligator can be spouse or the parent(s)/parents in law. Q: Is there any requirement for collateral or a co-borrower for Bank of Maharashtra Education loans?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_20", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 8, "content": "-borrower for Bank of Maharashtra Education loans? A: As per Model education loan scheme devised by IBA and subsequently implemented by our bank, no collateral security is required for loansupto ₹ 7.50 lakhs and for loan above ₹ 7.50 lakhs, acceptable tangible security with sufficient margin is insisted from the borrowers.Also, under \"Maha scholar education loan scheme\" of our Bank for students taking admission in Premier Institutes of India, no collateral security is required for loan upto ₹ 40.00 lakhs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_21", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 9, "content": " security is required for loan upto ₹ 40.00 lakhs. Q: Are there any processing fees on Bank of Maharashtra Education Loans? A: There is no processing fee irrespective of loan amount for Mahabank Scholar Loans for premier Institutes. For Mahabank Model Education Loans, there is a minimal Processing fee of 0.50% of the loan amount in case of studies abroad only& is refundable in case borrower takes up the course. Q: What is the repayment schedule for Bank of Maharashtra Education Loans? A: Education loan is being extended for 15 years of tenure.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_22", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 10, "content": "ion loan is being extended for 15 years of tenure. The repayment would begin after one year of the course period or six months after you get a job, whichever is earlier. Q: What expenses does the Bank of Maharashtra education loan cover? A: Bank of Maharashtra education loan covers various expenses like tuition fees, hostel fees, cost of books, Laptop/Computer cost etc. Q: What is the margin money required for Bank of Maharashtra Education Loans? A: For Maha Scholar Education Loan, there is no margin required for Premier Institutions listed under List 'A'.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_23", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 11, "content": "ed for Premier Institutions listed under List 'A'. For List 'B' & 'C' category Institutes, a minimal 5% margin of the loan amount is required. Under Model Education Loan uptoRs. 4 lakhs, there is no margin required. Above 4 lakhs, there is a required of 5% margin for studies in India and 15% for Studies abroad. Q: Does Bank of Maharashtra offers any special interest rates concessions for education loans? A: Yes, under Maha Scholar Education Loans, there is a concession of 0.10% in interest rate to Girl students.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_24", "original_file": "script_7.txt", "section_index": 8, "chunk_index": 12, "content": "ession of 0.10% in interest rate to Girl students. However, under Model Education Loan scheme, Bank offers interest concessions keeping the maximum concessions upto 0.50% for the following-0.50% concession for girl students0.50% concession to our existing Housing Loan borrowerUp to 0.25% for meritorious students. Q: From where I can get the application form? A: To Download Form for Offline Application       Cick here\n--- Navigated to 'Model Education Loan Scheme' page ---\nURL: https://bankofmaharashtra.bank.in/model-education-loan-scheme", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-8"}
{"chunk_id": "script_7_chunk_25", "original_file": "script_7.txt", "section_index": 9, "chunk_index": 0, "content": "Model Education Loan Scheme\n--- Scheme Table ---\nParameter: Purpose\nDetails:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-9"}
{"chunk_id": "script_7_chunk_26", "original_file": "script_7.txt", "section_index": 10, "chunk_index": 0, "content": "For Studies in India and Abroad\nParameter: Eligibility\nDetails:\nStudies in India: Graduation courses/Colleges under Universities approved by UGC. Other courses leading to diploma / degree etc. conducted by colleges / universities approved by UGC / Govt. / AICTE / AIBMS / ICMR etc. Studies Abroad : Job oriented Prof./Technical / PG courses/ Post Graduation: - MCA, MBA, MS etc\nParameter: Age\nDetails:\nStudent should be Indian national, have secured admission by Entrance test / Merit bases selection.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-10"}
{"chunk_id": "script_7_chunk_27", "original_file": "script_7.txt", "section_index": 10, "chunk_index": 1, "content": "dmission by Entrance test / Merit bases selection. Parameter: Maximum amount\nDetails:\nIn India : Rs. 10.00 lac\nAbroad : Rs. 20.00 lac", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-10"}
{"chunk_id": "script_7_chunk_28", "original_file": "script_7.txt", "section_index": 11, "chunk_index": 0, "content": "Loan for Higher Amount can be considered on merit and case to case basis\nParameter: Security\nDetails:\n - Up to Rs.7.5 lakhs: Clean. Parents / Guardian to be joint borrowers. All Eligible Education loans should be covered under Guarantee Fund Scheme for Education Loan (CGFSEL). - Above Rs.7.50 lakh: Collateral equivalent to quantum of finance after providing requisite margin. Parents / Guardian to be joint borrowers.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-11"}
{"chunk_id": "script_7_chunk_29", "original_file": "script_7.txt", "section_index": 11, "chunk_index": 1, "content": " margin. Parents / Guardian to be joint borrowers. Parameter: Up to 4 lakhs\nDetails:\nNIL\nParameter: Above 4 lakhs\nDetails:\n5% for studies in India\n15% for studies abroad\nParameter: Rate of Interest\nDetails:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-11"}
{"chunk_id": "script_7_chunk_30", "original_file": "script_7.txt", "section_index": 12, "chunk_index": 0, "content": "Click here to view the Interest Rate\n - Simple interest during moratorium period, there after compounded monthly\n - 1% interest concession may be provided to the loanees if the interest is serviced regularly as and when applied during the study period when repayment holiday is specified for interest/ repayment under the scheme. Interest concession is available only for moratorium period.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-12"}
{"chunk_id": "script_7_chunk_31", "original_file": "script_7.txt", "section_index": 12, "chunk_index": 1, "content": "oncession is available only for moratorium period. Parameter: Repayment\nDetails:\nCourse period + 1 year (Uniform 1 year moratorium for repayment after completion of studies in all cases)\nRepayment of the loan will be maximum 180 equated monthly instalments (EMIs). (i.e. 15 years maximum excluding moratorium period). Parameter: Special Offers\nDetails:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-12"}
{"chunk_id": "script_7_chunk_32", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 0, "content": "Interest rate concession\n - 0.50% concession for girl students\n - 0.50% concession to our existing Housing Loan borrower\n - Up to 0.25% for meritorious students. *Over all Maximum concession of 0.5% allowed\nParameter: Others\nDetails:\n - Loan will be granted to student with parent as Co-borrower/s\n - Loan will be disbursed in stages as per requirement directly to Institute / College.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_33", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 1, "content": "s per requirement directly to Institute / College. - Pre-approved Education loan (In principle sanction) is available for student applying to multiple universities/Colleges for study abroad. Parameter: Application Process\nDetails:\nUnified PM Vidyalaxmi Portal - 3 simple steps to apply for an educational loan. 1. Registration:- Student/User will register to PM-Vidyalaxmi portal (https://pmvidyalaxmi.co.in). Each user will be assigned a unique Student ID. 2.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_34", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 2, "content": "Each user will be assigned a unique Student ID. 2. Fill Up Single Form: - Students have to fill Common Education Loan Application Form by providing all the necessary details. After filling the form, the applicant can search for Educational Loan and APPLY as per his/her needs, eligibility and convenience. 3. Submit Application to Bank: - Students can submit application to bank for Educational Loan as per his/her needs, ease and convenience.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_35", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 3, "content": "l Loan as per his/her needs, ease and convenience. --- Mahabank Skill Loan Scheme ---\nURL: https://bankofmaharashtra.bank.in/maha-bank-skill-loan-scheme\nMahabank Skill Loan Scheme​\n--- Scheme Table ---\nS.No: 1\nParameter: Objective\nDetails:\nThe objective of the Skill Loan Scheme is to facilitate easy and affordable access to financial assistance for individuals seeking to enhance their skills through vocational training and skill development courses.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_36", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 4, "content": "vocational training and skill development courses. S.No: 2\nParameter: Eligibility criteria\nDetails:\nAny individual who has secured admission / who meets the eligibility criteria\" with minimum qualifications to undergo skill training for the National Skill Qualification Framework (NSQF) aligned courses and / or the Non-NSQF aligned courses by the training entities onboarded on the MSDE's Skill India Digital Hub (SIDH) platform, is eligible for a Skilling Loan and who has executed the loan documents with the lending institutions to avail the loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_37", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 5, "content": "s with the lending institutions to avail the loan. S.No: 3\nParameter: Courses and Institution Eligibility\nDetails:\nIndustrial Training Institutes (ITIs), polytechnics or school recognized by Central or State education Boards or college affiliated to recognized university, training partners affiliated to National Skill Development Corporation (NSDC) Sector Skill Councils, State Skill Mission, State Skill Corporation, preferably leading to a certificate / diploma / degree issued by such organization as per National Skill Qualification Framework (NSQF) and/ or", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_38", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 6, "content": "ional Skill Qualification Framework (NSQF) and/ or  the Non-NSQF aligned courses in skill development provided by the training entities onboarded on the MSDE,s Skill India Digital Hub (SIDH) platform.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_39", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 7, "content": "he MSDE,s Skill India Digital Hub (SIDH) platform. S.No: 4\nParameter: Minimum Qualification\nDetails:\nAs required by the enrolling institution/ organization as per National Skill Qualification Framework (NSQF) and/ or the Non-NSQF aligned courses in skill development provided by the training entities onboarded on the MSDE's skill India Digital Hub (SIDH) platform. S.No: 5\nParameter: Quantum Of Finance\nDetails:\n - Minimum Loan Amount: Rs.5000\n - Maximum Loan Amount: Rs.7,50,000\nS.No: 6\nParameter: Security/ Guarantee\nDetails:\n 1.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_40", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 8, "content": ".No: 6\nParameter: Security/ Guarantee\nDetails:\n 1. Parent/Guardian will execute loan documents along with the student, as joint borrower (co-borrower). 2. In case of married person, co-borrower can be spouse or the parent(s)/parents-in-law. 3. No collateral or third-party guarantee is required. Loan must be covered under Credit Guarantee Fund Scheme for Skill Development (CGFSSD) scheme mandatorily. S.No: 7\nParameter: Moratorium\nDetails:\n - For courses of duration up to 1 year – Moratorium up to 6 months from the completion of the course.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_41", "original_file": "script_7.txt", "section_index": 13, "chunk_index": 9, "content": " up to 6 months from the completion of the course. - For courses of duration above 1 year – Moratorium 12 months from the completion of the course. S.No: 8\nParameter: Repayment\nDetails:\n 1. Loans up to Rs.50,000: Up to 3 years\n 2. Loans above Rs.50,000 and up to Rs.1 lakh: Up to 5 years\n 3. Loans above Rs.1 lakh: Up to 7 years\nS.No: 9\nParameter: Processing charges\nDetails:\nNIL\nS.No: 10\nParameter: Rate of Interest\nDetails:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-13"}
{"chunk_id": "script_7_chunk_42", "original_file": "script_7.txt", "section_index": 14, "chunk_index": 0, "content": "Click here\nS.No: 11\nParameter: Application Process\nDetails:\nUnified PM Vidyalaxmi Portal - 3 simple steps to apply for an educational loan. 1. Registration:- Student/User will register to PM-Vidyalaxmi portal (https://pmvidyalaxmi.co.in). Each user will be assigned a unique Student ID. 2. Fill Up Single Form: - Students have to fill Common Education Loan Application Form by providing all the necessary details.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-14"}
{"chunk_id": "script_7_chunk_43", "original_file": "script_7.txt", "section_index": 14, "chunk_index": 1, "content": "ation Form by providing all the necessary details. After filling the form, the applicant can search for Educational Loan and APPLY as per his/her needs, eligibility and convenience. 3. Submit Application to Bank: - Students can submit application to bank for Educational Loan as per his/her needs, ease and convenience.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-14"}
{"chunk_id": "script_7_chunk_44", "original_file": "script_7.txt", "section_index": 14, "chunk_index": 2, "content": "l Loan as per his/her needs, ease and convenience. --- PM - Vidya Laxmi (PMVS) ---\nURL: https://bankofmaharashtra.bank.in/pm-vidya-laxmi\nPM - Vidya Laxmi (PMVS): Education Loan Scheme\nThe Union Cabinet on 6th November 2024 approved \"Pradhan Mantri Vidyalaxmi\" (PM-Vidyalaxmi), a Central Sector Scheme to financial support to meritorious students so that financial constraints do not prevent any youth of India from pursuing quality higher education.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-14"}
{"chunk_id": "script_7_chunk_45", "original_file": "script_7.txt", "section_index": 14, "chunk_index": 3, "content": "h of India from pursuing quality higher education. Pradhan Mantri Vidya Laxmi (PM – Vidyalaxmi) is a special loan product will enable collateral free, guarantor free education loans to meritorious students who get admission in the top 860 quality Higher Educational Institutions (QHEIs) of the nation. The broad contours of the scheme are:\nSr. No", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-14"}
{"chunk_id": "script_7_chunk_46", "original_file": "script_7.txt", "section_index": 15, "chunk_index": 0, "content": "Scheme Name\nPM - Vidya Laxmi (PMVS): Education Loan scheme", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-15"}
{"chunk_id": "script_7_chunk_47", "original_file": "script_7.txt", "section_index": 16, "chunk_index": 0, "content": "Objective\nProviding financial support education loans to the meritorious students who get admission in the quality Higher Educational Institutions (QHEIs) of the nation", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-16"}
{"chunk_id": "script_7_chunk_48", "original_file": "script_7.txt", "section_index": 17, "chunk_index": 0, "content": "Eligibility criteria\nShould have secured admission to a higher education course in the 860 institutions.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-17"}
{"chunk_id": "script_7_chunk_49", "original_file": "script_7.txt", "section_index": 18, "chunk_index": 0, "content": "Meritorious\nAdmission in these select Premier institutions through common entrance test could be considered a meritorious student.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-18"}
{"chunk_id": "script_7_chunk_50", "original_file": "script_7.txt", "section_index": 19, "chunk_index": 0, "content": "Categorisation Institutions\nList of select 860 quality Higher Educational Institutions (list of Institutions)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-19"}
{"chunk_id": "script_7_chunk_51", "original_file": "script_7.txt", "section_index": 20, "chunk_index": 0, "content": "Courses Eligible\nAll the Graduation/ Post Graduation degree and diploma courses offered by 860 quality Higher Educational Institutions.\nExpenses considered for loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-20"}
{"chunk_id": "script_7_chunk_52", "original_file": "script_7.txt", "section_index": 21, "chunk_index": 0, "content": "Quantum of Finance\nNeed based Finance linked to total education expenses.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-21"}
{"chunk_id": "script_7_chunk_53", "original_file": "script_7.txt", "section_index": 22, "chunk_index": 0, "content": "Above 4 lakhs\n5%\nScholarship, teaching/research assistantship can be included in the margin.\nSecurity/ Guarantee\nThe co-borrower should be parent(s)/guardian of the student borrower. In case of married person, co-borrower can be spouse or the parent(s)/parents-in-law.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-22"}
{"chunk_id": "script_7_chunk_54", "original_file": "script_7.txt", "section_index": 23, "chunk_index": 0, "content": "Moratorium period\nCourse period* + 1 year after completion of study.\n(*the period of completion of initial course for which student is seeking admission)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-23"}
{"chunk_id": "script_7_chunk_55", "original_file": "script_7.txt", "section_index": 24, "chunk_index": 0, "content": "Repayment\nRepayment of the loan will be maximum 180 equated monthly instalments (EMIs). (i.e. 15 years' maximum excluding moratorium period).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-24"}
{"chunk_id": "script_7_chunk_56", "original_file": "script_7.txt", "section_index": 25, "chunk_index": 0, "content": "Charges\nProcessing Charge- No processing/ upfront charges.\nAccount Handling Charges - As per service charges booklet., Presently - Rs. 500+0.20 % of Loan amount\nPM Vidya Laxmi Enrolment charges to be borne by the student (Rs. 100 + GST, subject to change).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-25"}
{"chunk_id": "script_7_chunk_57", "original_file": "script_7.txt", "section_index": 26, "chunk_index": 0, "content": "Interest subvention\nThe eligibility for interest subvention in PM-Vidyalaxmi and PM-USP CSIS in the QHEIs is given in the table below:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-26"}
{"chunk_id": "script_7_chunk_58", "original_file": "script_7.txt", "section_index": 27, "chunk_index": 0, "content": "Other courses\nAnnual income Up to Rs 4.5 lakhs\n100% interest subvention\n(PM-USP CSIS)\n3% interest subvention\n(PM-Vidyalaxmi)\nAnnual income Rs 4.5 lakhs to Rs 8 lakhs\n3% interest subvention\n(PM-Vidyalaxmi)\n3% interest subvention\n(PM-Vidyalaxmi)\nStudent availing any other Central /State Government Scholarship, or any other interest subvention scheme or Fee reimbursement shall not be eligible for availing benefits under this Scheme.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-27"}
{"chunk_id": "script_7_chunk_59", "original_file": "script_7.txt", "section_index": 27, "chunk_index": 1, "content": " eligible for availing benefits under this Scheme. The definition of \"family\", for the purpose of determining the family income criteria in this scheme shall be the student plus her/ his father & mother plus her/ his spouse, wherever applicable.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-27"}
{"chunk_id": "script_7_chunk_60", "original_file": "script_7.txt", "section_index": 27, "chunk_index": 2, "content": " mother plus her/ his spouse, wherever applicable. Credit Guarantee on education loans:\n-Education loan sanction amount is up to ₹ 7.5 lakhs, irrespective of family income, the student shall be eligible for credit guarantee where 75% of outstanding default will be covered by Government, as per the other existing guidelines of the PM-USP Credit Guarantee Fund Scheme for Education Loans (CGFSEL) run by DHE.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-27"}
{"chunk_id": "script_7_chunk_61", "original_file": "script_7.txt", "section_index": 28, "chunk_index": 0, "content": "Disbursement of Interest Subsidy Claims\nCheck list / List of Documents required.\n1. Student-applicant:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-28"}
{"chunk_id": "script_7_chunk_62", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 0, "content": "Application Process\nUnified PM Vidyalaxmi Portal - 3 simple steps to apply for an educational loan. - A special loan product will enable collateral free, guarantor free education loans. - Simple, transparent, student-friendly and entirely digital application process. - 3% interest subvention during moratorium to One Lakh students with family income up to Rs 8 Lakh. - Full interest subvention during moratorium for loans up to Rs. 10 Lakh for students with family income up to Rs 4.50 Lakh.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_63", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 1, "content": "or students with family income up to Rs 4.50 Lakh. - Loan amounts up to ₹ 7.5 lakhs will be provided a 75% credit guarantee by the Government of India through NCGTC. - Education Loans under Management Quota not Eligible\n - The student should be an Indian National (including NRI). - For Overseas Citizens in India (OCI), and students who are born abroad (overseas citizenship by birth, when parents were on deputation with Foreign Govt./Govt. agencies or International / Regional Agencies etc.) and are now studying in India after repatriation of their parents.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_64", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 2, "content": "ying in India after repatriation of their parents. - Once the application for interest subvention gets approved, the student will get sms, email and whatsapp message to install the e-voucher/Programmable /Central Bank Digital Currency (CBDC) wallets on their mobiles. - On receipt of claims from Banks, interest subvention amount will be credited to e-voucher/Programmable CBDC wallet of each student.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_65", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 3, "content": "-voucher/Programmable CBDC wallet of each student. - Once the student opts for redemption of the e-voucher/ Programmable CBDC towards repayment of his/her education loan amount, this interest subvention amount shall get credited to his/her education loan account through Direct Benefit Transfer (DBT) towards interest payment through Public Financial Management System (PFMS) Portal and National Automated Clearing House (NACH), as per guidelines of the Department of Expenditure, Ministry of Finance. - KYC Details (Student) – Aadhaar, PAN ID and Address Proof.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_66", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 4, "content": "ils (Student) – Aadhaar, PAN ID and Address Proof. - Previous Qualifying self-attested copy of Mark sheets. - Entrance Exam Result. - Proof of admission: Offer letter from Institution along with Fee Structure\n - If the QHEI has already accepted some of these documents such as Income /Caste /benchmark disability certificates at the time of admission, the student should submit a certificate regarding the same from the QHEI (As per the format provided under PM Vidya Laxmi Scheme-Annexure).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_67", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 5, "content": "at provided under PM Vidya Laxmi Scheme-Annexure). Only the remaining documents will have to be submitted by the students to the bank / portal. - Passport-size photographs. - Aadhaar should be made mandatory, wherever applicable as per Supreme Court decision. - PAN Card is mandatory document to be submitted along-with application. - Proof of Identity and address as per KYC norms. - Passport-size photographs. - Previous/ existing Loans, if any, from Banks/ Lenders, banks may obtain suitable documentary evidence.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_68", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 6, "content": "s, banks may obtain suitable documentary evidence. - Pan Card and Aadhar is a mandatory document and to be submitted alongwith loan application. - Income Documents of parents/ Co- Applicants. (As applicable)\n - Proof of Income from designated public authority of the state. 1. Fee payable to college/ hostel\n 2. Examination/ Library/ Laboratory fee\n 3. Insurance premium for student borrower\n 4. Caution deposit, building fund / refundable deposit supported by   Institution bills/receipts. 5. Purchase of books/ equipment/ instruments/ uniforms\n 6.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_69", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 7, "content": "ase of books/ equipment/ instruments/ uniforms\n 6. Purchase of computer at reasonable cost, if required for completion of the course\n 7. Any other expense required to complete the course - like academic and maintenance Fees, study tours, project work, thesis, exchange programme, etc. 1. Co-obligation of parents/guardian as joint co-borrowers. The co-borrower should be parent(s)/guardian of the student borrower. In case of married person, co-borrower can be spouse or the parent(s)/parents-in-law. 2. No collateral security required. 1.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_70", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 8, "content": "nts-in-law. 2. No collateral security required. 1. Registration:- Student/User will register to PM-Vidyalaxmi portal (https://pmvidyalaxmi.co.in). Each user will be assigned a unique Student ID. 2. Fill Up Single Form: - Students have to fill Common Education Loan Application Form by providing all the necessary details. After filling the form, the applicant can search for Educational Loan and APPLY as per his/her needs, eligibility and convenience. 3.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_71", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 9, "content": "per his/her needs, eligibility and convenience. 3. Submit Application to Bank: - Students can submit application to bank for Educational Loan as per his/her needs, ease and convenience. --- Scheme Table ---\nSr. No: 1. Particulars: Scheme Name\nGuidelines:\nPM - Vidya Laxmi (PMVS): Education Loan scheme\nSr. No: 2. Particulars: Objective\nGuidelines:\nProviding financial support education loans to the meritorious students who get admission in the quality Higher Educational Institutions (QHEIs) of the nation\nSr. No: 3.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_72", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 10, "content": "onal Institutions (QHEIs) of the nation\nSr. No: 3. Particulars: Nationality\nGuidelines:\n - The student should be an Indian National (including NRI). - For Overseas Citizens in India (OCI), and students who are born abroad (overseas citizenship by birth, when parents were on deputation with Foreign Govt./Govt. agencies or International / Regional Agencies etc.) and are now studying in India after repatriation of their parents. Sr. No: 4.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_73", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 11, "content": "ia after repatriation of their parents. Sr. No: 4. Particulars: Eligibility criteria\nGuidelines:\nShould have secured admission to a higher education course in the 860 institutions. Sr. No: 5. Particulars: Meritorious\nGuidelines:\nAdmission in these select Premier institutions through common entrance test could be considered a meritorious student. Sr. No: 6. Particulars: Categorisation Institutions\nGuidelines:\nList of select 860 quality Higher Educational Institutions (list of Institutions)\nSr. No: 7.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_74", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 12, "content": "nal Institutions (list of Institutions)\nSr. No: 7. Particulars: Courses Eligible\nGuidelines:\nAll the Graduation/ Post Graduation degree and diploma courses offered by 860 quality Higher Educational Institutions. Sr. No: 8. Particulars: Expenses considered for loan. Guidelines:\n 1. Fee payable to college/ hostel\n 2. Examination/ Library/ Laboratory fee\n 3. Insurance premium for student borrower\n 4. Caution deposit, building fund / refundable deposit supported by   Institution bills/receipts. 5. Purchase of books/ equipment/ instruments/ uniforms\n 6.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_75", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 13, "content": "ase of books/ equipment/ instruments/ uniforms\n 6. Purchase of computer at reasonable cost, if required for completion of the course\n 7. Any other expense required to complete the course - like academic and maintenance Fees, study tours, project work, thesis, exchange programme, etc. Sr. No: 9. Particulars: Quantum of Finance\nGuidelines:\nNeed based Finance linked to total education expenses. Sr. No: 11. Particulars: Security/ Guarantee\nGuidelines:\n 1. Co-obligation of parents/guardian as joint co-borrowers.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_76", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 14, "content": "igation of parents/guardian as joint co-borrowers. The co-borrower should be parent(s)/guardian of the student borrower. In case of married person, co-borrower can be spouse or the parent(s)/parents-in-law. 2. No collateral security required. Sr. No: 12. Particulars: Moratorium period\nGuidelines:\nCourse period* + 1 year after completion of study. (*the period of completion of initial course for which student is seeking admission)\nSr. No: 13. Particulars: Repayment\nGuidelines:\nRepayment of the loan will be maximum 180 equated monthly instalments (EMIs).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_77", "original_file": "script_7.txt", "section_index": 29, "chunk_index": 15, "content": "be maximum 180 equated monthly instalments (EMIs). (i.e. 15 years' maximum excluding moratorium period). Sr. No: 14. Particulars: Rate of Interest\nGuidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-29"}
{"chunk_id": "script_7_chunk_78", "original_file": "script_7.txt", "section_index": 30, "chunk_index": 0, "content": "Click here\nSr. No: 15.\nParticulars: Charges\nGuidelines:\nProcessing Charge- No processing/ upfront charges.\nAccount Handling Charges - As per service charges booklet., Presently - Rs. 500+0.20 % of Loan amount\nPM Vidya Laxmi Enrolment charges to be borne by the student (Rs. 100 + GST, subject to change).", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-30"}
{"chunk_id": "script_7_chunk_79", "original_file": "script_7.txt", "section_index": 31, "chunk_index": 0, "content": "No Prepayment charges\nSr. No: Annual income\nParticulars: Technical/ Professional courses\nGuidelines:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-31"}
{"chunk_id": "script_7_chunk_80", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 0, "content": "Other courses\nSr. No: Annual income Up to Rs 4.5 lakhs\nParticulars: 100% interest subvention\n(PM-USP CSIS)\nGuidelines:\n3% interest subvention\n(PM-Vidyalaxmi)\nSr. No: Annual income Rs 4.5 lakhs to Rs 8 lakhs\nParticulars: 3% interest subvention\n(PM-Vidyalaxmi)\nGuidelines:\n3% interest subvention\n(PM-Vidyalaxmi)\nSr. No: 17.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_81", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 1, "content": "3% interest subvention\n(PM-Vidyalaxmi)\nSr. No: 17. Particulars: Credit Guarantee on education loans:\nGuidelines:\n-Education loan sanction amount is up to ₹ 7.5 lakhs, irrespective of family income, the student shall be eligible for credit guarantee where 75% of outstanding default will be covered by Government, as per the other existing guidelines of the PM-USP Credit Guarantee Fund Scheme for Education Loans (CGFSEL) run by DHE. Sr. No: 18.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_82", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 2, "content": "r Education Loans (CGFSEL) run by DHE. Sr. No: 18. Particulars: Disbursement of Interest Subsidy Claims\nGuidelines:\n - Once the application for interest subvention gets approved, the student will get sms, email and whatsapp message to install the e-voucher/Programmable /Central Bank Digital Currency (CBDC) wallets on their mobiles. - On receipt of claims from Banks, interest subvention amount will be credited to e-voucher/Programmable CBDC wallet of each student.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_83", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 3, "content": "-voucher/Programmable CBDC wallet of each student. - Once the student opts for redemption of the e-voucher/ Programmable CBDC towards repayment of his/her education loan amount, this interest subvention amount shall get credited to his/her education loan account through Direct Benefit Transfer (DBT) towards interest payment through Public Financial Management System (PFMS) Portal and National Automated Clearing House (NACH), as per guidelines of the Department of Expenditure, Ministry of Finance. Sr. No: 19.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_84", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 4, "content": "t of Expenditure, Ministry of Finance. Sr. No: 19. Particulars: Check list / List of Documents required. Guidelines:\n1. Student-applicant:\nNote:\n2. Co-applicant\n3. Income Limit/ Proof\n - KYC Details (Student) – Aadhaar, PAN ID and Address Proof. - Previous Qualifying self-attested copy of Mark sheets. - Entrance Exam Result.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_85", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 5, "content": "ested copy of Mark sheets. - Entrance Exam Result. - Proof of admission: Offer letter from Institution along with Fee Structure\n - If the QHEI has already accepted some of these documents such as Income /Caste /benchmark disability certificates at the time of admission, the student should submit a certificate regarding the same from the QHEI (As per the format provided under PM Vidya Laxmi Scheme-Annexure). Only the remaining documents will have to be submitted by the students to the bank / portal. - Passport-size photographs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_86", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 6, "content": "to the bank / portal. - Passport-size photographs. - Aadhaar should be made mandatory, wherever applicable as per Supreme Court decision. - PAN Card is mandatory document to be submitted along-with application. - Proof of Identity and address as per KYC norms. - Previous/ existing Loans, if any, from Banks/ Lenders, banks may obtain suitable documentary evidence. - Pan Card and Aadhar is a mandatory document and to be submitted alongwith loan application. - Income Documents of parents/ Co- Applicants.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_87", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 7, "content": "on. - Income Documents of parents/ Co- Applicants. (As applicable)\n - Proof of Income from designated public authority of the state. Sr. No: 20. Particulars: Application Process\nGuidelines:\nUnified PM Vidyalaxmi Portal - 3 simple steps to apply for an educational loan. 1. Registration:- Student/User will register to PM-Vidyalaxmi portal (https://pmvidyalaxmi.co.in). Each user will be assigned a unique Student ID. 2. Fill Up Single Form: - Students have to fill Common Education Loan Application Form by providing all the necessary details.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_7_chunk_88", "original_file": "script_7.txt", "section_index": 32, "chunk_index": 8, "content": "ation Form by providing all the necessary details. After filling the form, the applicant can search for Educational Loan and APPLY as per his/her needs, eligibility and convenience. 3. Submit Application to Bank: - Students can submit application to bank for Educational Loan as per his/her needs, ease and convenience.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_7.txt-32"}
{"chunk_id": "script_8_chunk_0", "original_file": "script_8.txt", "section_index": 0, "chunk_index": 0, "content": "Passport\n * Election ID Card\n * Pan Card\n * Aadhar Card\n * Driving License\n * Photo Identity card issued by the current Employer\n * Passport\n- Election ID Card\n- Pan Card\n- Aadhar Card\n- Driving License\n- Photo Identity card issued by the current Employer\n- Passport\n- Proof of Residence : (any one)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-0"}
{"chunk_id": "script_8_chunk_1", "original_file": "script_8.txt", "section_index": 1, "chunk_index": 0, "content": "Passport\n * Electricity Bill\n * Election ID Card\n * Telephone Bill (Landline)\n * Aadhar Card\n * Driving License\n * Passport\n- Electricity Bill\n- Election ID Card\n- Telephone Bill (Landline)\n- Aadhar Card\n- Driving License\n- Passport\n--- Interest Rates ---\nGold Loan Interest Rate: 8.50 % P.A*\nFore more Interest Rates & Charges Click here\n--- Gold Loan Eligibility ---\nHow will Bank of Maharashtra decide the gold loan amount i am eligible for?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-1"}
{"chunk_id": "script_8_chunk_2", "original_file": "script_8.txt", "section_index": 2, "chunk_index": 0, "content": "Eligible Loan Limit\nAll Individuals including Bank staff desirous of availing Gold Loan against Gold Jwellery / ornaments.\nThe applicant should satisfy the KYC guidelines.\nScale of finance will be applicable on the basis of repayment type & ROI as below\nA.    EMI / PED (Interest Payment Only)  – Tenure up to 12 months", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-2"}
{"chunk_id": "script_8_chunk_3", "original_file": "script_8.txt", "section_index": 3, "chunk_index": 0, "content": "Scale of Finance\n(per gram)\nUpto ₹100.00 lakh\n75%\nRLLR + 0.45% = 8.50%\n₹ 8290/-\nUpto ₹ 5.00 lakh\n80%\nRLLR + 0.95% = 9.25%\n₹ 8850/-\nUpto ₹ 2.50 lakh\n85%\nRLLR + 1.20% = 9.50%\n₹ 9410/-\nB.    Bullet Repayment – Tenure upto 12 months", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-3"}
{"chunk_id": "script_8_chunk_4", "original_file": "script_8.txt", "section_index": 4, "chunk_index": 0, "content": "Scale of Finance\n(per gram)\nUpto ₹100.00 lakh\n65%\nRLLR + 0.45% = 8.50%\n₹ 7170/-\nUpto ₹ 5.00 lakh\n70%\nRLLR + 0.95% = 9.25%\n₹ 7730/-\nUpto ₹ 2.50 lakh\n75%\nRLLR + 1.20% = 9.50%\n₹ 8290/-\nIf you are considering applying for a gold loan, understanding the loan eligibility is essential. - Age Criteria: Applicants must be 18 years or older. - Ownership: Only those who own the gold ornaments or jewellery can pledge them as security.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-4"}
{"chunk_id": "script_8_chunk_5", "original_file": "script_8.txt", "section_index": 4, "chunk_index": 1, "content": "rnaments or jewellery can pledge them as security. - KYC Compliance: Basic identity and address proof as per banking guidelines must be provided. --- Gold Loan Repayment ---", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-4"}
{"chunk_id": "script_8_chunk_6", "original_file": "script_8.txt", "section_index": 5, "chunk_index": 0, "content": "Repayment Mode\nA) Term Loan Facility\nB) Cash Credit\n1. Principal Equally Distributed / EMI\n2. Bullet Repayment\nPricipal:\nInterest:\nInterest :\nThe maximum repayment period is 24 Months. Repayment should be fixed in terms of monthly / quarterly / half yearly / Yearly.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-5"}
{"chunk_id": "script_8_chunk_7", "original_file": "script_8.txt", "section_index": 6, "chunk_index": 0, "content": "Interest should be charged on monthly basis and should be serviced as and when applied\nThe repayment period of such loans shall not exceed 12 months. Bullet Repayment of Interest & Principal at the end of term. Interest will be charged to the account at monthly rests but will become due for payment along with Principal only at maturity.\nAnnual Review subject to entire amount to be repaid once in year.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-6"}
{"chunk_id": "script_8_chunk_8", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 0, "content": "Interest should be charged on monthly basis and should be serviced as and when applied\n--- Frequently Asked Questions (FAQs) ---\nQ: What is a gold loan / Definition of Gold Loan? A: As the name suggests this is the loan given against gold. It's a secured loan that enables borrowers to pledge their gold in lieu of a cash loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_9", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 1, "content": "owers to pledge their gold in lieu of a cash loan. It enables people to utilize their gold assets instead of storing them in lockers.A gold loan is a method of availing finance/loan against your gold ornaments or jewellery such as bangles, necklaces, bracelets, earrings, pendants, gold coins (issued by Banks Only in tamper proof packaging) etc. Q: What are the rules for gold loan / rate of Gold Loan per gram? A: Scale of finance will be applicable on the basis of repayment type & ROI as below A.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_10", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 2, "content": "e on the basis of repayment type & ROI as below A. EMI / PED (Interest Payment Only)  – Tenure up to 12 monthsLoan SlabMax. LTV at sanctionROIScale of Finance(per gram)Upto ₹100.00 lakh75%RLLR + 0.45% = 8.50%₹ 8290/-Upto ₹ 5.00 lakh80%RLLR + 0.95% = 9.25%₹ 8850/-Upto ₹ 2.50 lakh85%RLLR + 1.20% = 9.50%₹ 9410/-B. Bullet Repayment – Tenure upto 12 monthsLoan SlabMax.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_11", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 3, "content": "let Repayment – Tenure upto 12 monthsLoan SlabMax. LTV at sanctionROIScale of Finance(per gram)Upto ₹100.00 lakh65%RLLR + 0.45% = 8.50%₹ 7170/-Upto ₹ 5.00 lakh70%RLLR + 0.95% = 9.25%₹ 7730/-Upto ₹ 2.50 lakh75%RLLR + 1.20% = 9.50%₹ 8290/-\nQ: What is the best way to apply for a Bank of Maharashtra Gold Loan (Loan Against Gold)? A: You can start the process of applying for a Best Gold Loan in any of the following ways:In person at any Bank of Maharashtra Branch.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_12", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 4, "content": " ways:In person at any Bank of Maharashtra Branch. To find the closest Branch to you, please click hereApply from anywhere anytime with our online application. To apply online please click hereBy contacting our call centre. To find the toll-free numbers, click here\nQ: What does the gold loan interest rates applicable / What is the rate of interest charged on gold loans? How is the interest calculated? A: Gold loan rate of Interest are fixed and offered as on date of Loan disbursement.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_13", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 5, "content": "fixed and offered as on date of Loan disbursement. Bank of Maharashtra's Lowest Gold Loan Interest rate starts from 8.50% p.a*., subject to change as per RBI norms and at the discretion of the bank.Monthly compounding interest is charged, which the borrower has to pay at the specified periodicity or at the closure of loan, whichever is earlier. The interest rate is fixed and calculated on a reducing balance basis.*Gold Loan under retail advances\nQ: Is PAN card mandatory for a gold loan? A: A PAN card is not a mandatory document to apply for a gold loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_14", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 6, "content": "not a mandatory document to apply for a gold loan. However, the applicant should satisfy the KYC guideline. Q: Who can apply for Loan Against Gold? A: All individuals including bank staff can avail the gold loan against gold ornaments / jewellery from Mahabank. Q: What are the additional fees that I will need to pay at the time of taking a loan? A: There is No charges for Documentation and Inspection. Processing charges will be varying on loan amount and right now 'NIL' up to loan of Rs. 10.00 lakh. Q: Do I need a guarantor to avail the gold loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_15", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 7, "content": ". Q: Do I need a guarantor to avail the gold loan? A: While availing Bank Of Maharashtra Gold Loan No Guarantor is required. Q: Is a CIBIL score required for a Mahabank gold loan? A: No, a CIBIL score is not required when availing a Mahabank gold loan. The eligibility criteria for a gold loan does not include a credit score or credit check of any sorts - only the KYC documents required for gold loan should be submitted. Q: How is the interest rate calculated for gold loans? A: The gold loan interest is calculated differently and is set by the bank.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_16", "original_file": "script_8.txt", "section_index": 7, "chunk_index": 8, "content": " is calculated differently and is set by the bank. --- What is the Gold Loan Process? ---\nThe gold loan process at the Bank of Maharashtra is designed to be simple and efficient:\nThe entire process is quick & transparent ensuring that customers can access funds when they need them most and get the correct value of their gold. 1. Visit the Branch: Carry your gold ornaments and required documents.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-7"}
{"chunk_id": "script_8_chunk_17", "original_file": "script_8.txt", "section_index": 8, "chunk_index": 0, "content": "Proof of Residence\n2. Passport Size Photographs\n3. Proof of Identification\n4. Proof of Residence\n5. Gold Valuation: The bank's experts assess the purity and weight of the gold to determine its value. This is done in front of you keeping complete transparency.\n6. Loan Sanction: Based on the valuation, a loan amount is approved as per the current market price of gold.\n7. Loan Disbursal: Once approved, the gold loan amount is credited to the bank account of your choice.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_8.txt-8"}
{"chunk_id": "script_9_chunk_0", "original_file": "script_9.txt", "section_index": 0, "chunk_index": 0, "content": "Passport\n * Election ID Card\n * Pan Card\n * Aadhar Card\n * Driving License\n * Photo Identity card issued by the current Employer\n * Passport\n- Election ID Card\n- Pan Card\n- Aadhar Card\n- Driving License\n- Photo Identity card issued by the current Employer\n- Passport\n- Proof of Residence : (any one)", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-0"}
{"chunk_id": "script_9_chunk_1", "original_file": "script_9.txt", "section_index": 1, "chunk_index": 0, "content": "Passport\n * Electricity Bill\n * Election ID Card\n * Telephone Bill (Landline)\n * Aadhar Card\n * Driving License\n * Photo Identity card issued by the current Employer\n * Passport\n- Electricity Bill\n- Election ID Card\n- Telephone Bill (Landline)\n- Aadhar Card\n- Driving License\n- Photo Identity card issued by the current Employer\n- Passport\n- For Salaried Persons\nOriginal/Certified copy of the latest salary slips for the past 3 months\nCopies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessm", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-1"}
{"chunk_id": "script_9_chunk_2", "original_file": "script_9.txt", "section_index": 1, "chunk_index": 1, "content": "st 2 years duly acknowledged by IT Dept/IT assessm ent orders or Form 16 for last 2 years from the Employer.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-1"}
{"chunk_id": "script_9_chunk_3", "original_file": "script_9.txt", "section_index": 1, "chunk_index": 2, "content": "ers or Form 16 for last 2 years from the Employer. Undertaking from employer for remittance of monthly installment, wherever feasible. Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n * Original/Certified copy of the latest salary slips for the past 3 months\n * Copies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. * Undertaking from employer for remittance of monthly installment, wherever feasible.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-1"}
{"chunk_id": "script_9_chunk_4", "original_file": "script_9.txt", "section_index": 1, "chunk_index": 3, "content": "ittance of monthly installment, wherever feasible. * Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n- Original/Certified copy of the latest salary slips for the past 3 months\n- Copies of IT returns of last 2 years duly acknowledged by IT Dept/IT assessment orders or Form 16 for last 2 years from the Employer. - Undertaking from employer for remittance of monthly installment, wherever feasible.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-1"}
{"chunk_id": "script_9_chunk_5", "original_file": "script_9.txt", "section_index": 1, "chunk_index": 4, "content": "ittance of monthly installment, wherever feasible. - Bank Account (Salaried Account) statement for the last 6 months (in case of other Bank)\n- For Non-Salaried Class /Businessman /Professional\nLatest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-1"}
{"chunk_id": "script_9_chunk_6", "original_file": "script_9.txt", "section_index": 2, "chunk_index": 0, "content": "Bank statement for past one year\n * Latest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc. * Shop Establishment Act\n * Tax Registration Copy\n * Company Registration License\n * Bank statement for past one year\n- Latest 3 years of IT returns (2 years in case of Professionals) including computation of income, profit and Loss Account, Balance sheet, Audit Report etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-2"}
{"chunk_id": "script_9_chunk_7", "original_file": "script_9.txt", "section_index": 2, "chunk_index": 1, "content": "and Loss Account, Balance sheet, Audit Report etc. - Shop Establishment Act\n- Tax Registration Copy\n- Company Registration License\n- Bank statement for past one year\n- Other documents as applicable as per scheme of loan.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-2"}
{"chunk_id": "script_9_chunk_8", "original_file": "script_9.txt", "section_index": 2, "chunk_index": 2, "content": "her documents as applicable as per scheme of loan. --- Personal Loan Interest Rates ---\nPersonal Loan Interest Rate Starting From: 8.75 %P.A*\nFore more Interest Rates & Charges Click here\nTo know more Interest Rates & Charges about other Personal Loan Schemes\n- Personal Loan scheme for Salaried customers Click here\n- Personal Loan scheme for Professionals Click here\n- Personal Loan scheme - for Business Class having Home Loan with us Click here\n--- Personal Loan EMI Calculator ---\nPrincipal Loan Amount *:\nInterest Rate ( % p.a ) *:\nLoan Term (Years) * :", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-2"}
{"chunk_id": "script_9_chunk_9", "original_file": "script_9.txt", "section_index": 3, "chunk_index": 0, "content": "SHOW EMI\nMonthly Payment (EMI):\nRs. 2064\nTotal Interest:\nRs. 23823\nTotal Repayment:\nRs. 123823\n--- Frequently Asked Questions (FAQs) ---\nQ: What is a Personal Loan? A: A Personal Loan is a loan that can be availed for any personal purpose such as home renovation, wedding, medical emergencies, travelling, debt repayments, bill payments and more. Unlike other loans, Personal Loan does not require any collateral or security and can be easily availed with minimum documentation.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-3"}
{"chunk_id": "script_9_chunk_10", "original_file": "script_9.txt", "section_index": 3, "chunk_index": 1, "content": " can be easily availed with minimum documentation. Like any other loan, you can repay Personal Loan with EMI (Equated Monthly Instalments); debited from your bank account. Q: How does Personal Loan Work? A: To avail the Personal Loan, all you need to do is submit the loan application form. On meeting the eligibility criteria, you will get an offer with the sanctioned amount, tenure of loan and interest rate. Once you accept the offer, funds are transferred to your bank account instantly. Q: How can I know what my EMI amount is?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-3"}
{"chunk_id": "script_9_chunk_11", "original_file": "script_9.txt", "section_index": 3, "chunk_index": 2, "content": "nstantly. Q: How can I know what my EMI amount is? A: You can use the Personal Loan EMI Calculator to know your EMI amount before applying for the Loan. Q: What can a Personal Loan be used for? A: Funds from Personal Loan can be used to cater to requirements of meeting personal expenses. Q: How can I repay my Personal Loan?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-3"}
{"chunk_id": "script_9_chunk_12", "original_file": "script_9.txt", "section_index": 3, "chunk_index": 3, "content": "nal expenses. Q: How can I repay my Personal Loan? A: You can repay your Personal Loan via an auto-debit instruction through your Bank account on a stipulated date every month to repay your EMI.Maha Bank Personal Loan scheme for Salaried customersFor Category A a) Salary Account with Bank of Maharashtra - 84 months b) Salary Account with Other Bank - 60 monthsFor Category B & C60 monthsMaha Bank Personal Loan scheme for Professionals60 monthsBank Personal Loan scheme - for Business Class having Home Loan with us84 months\nQ: Can I apply for Personal Loan thr", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-3"}
{"chunk_id": "script_9_chunk_13", "original_file": "script_9.txt", "section_index": 3, "chunk_index": 4, "content": "h us84 months\nQ: Can I apply for Personal Loan thr ough any App?", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-3"}
{"chunk_id": "script_9_chunk_14", "original_file": "script_9.txt", "section_index": 3, "chunk_index": 5, "content": "ough any App? A: Yes, You can apply for Personal loan through Bank of Maharashtra's \"MahaMobile APP\". Download the MahaMobile app from following links:Android: Download Android AppIOS: Download IOS App\n--- Personal Loan How to Apply ---\nFollow the step by step instructions to avail digital loan facility from our bank. Please click on the following link to view how to apply for Digital Loan Online:", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-3"}
{"chunk_id": "script_9_chunk_15", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 0, "content": "How to Apply for Digital Loans Online\n--- Similar Products ---\n- Personal Loan scheme for Salaried customers - Mahabank Personal Loan scheme is to cater to the requirements of meeting personal expenses. (Link: //bankofmaharashtra.bank.in/personal-loan-for-salaried-customers)\n- Personal Loan scheme for Professionals - Personal expenses - medical, pilgrimage domestic needs, etc.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_16", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 1, "content": "xpenses - medical, pilgrimage domestic needs, etc. (Link: //bankofmaharashtra.bank.in/personal-loan-for-professionals)\n- Personal Loan scheme - for Business Class having Home Loan with us - To cater to the requirements of meeting personal expenses (Link: //bankofmaharashtra.bank.in/personal-loan-for-businessclass-having-home-loan-with-us)\n- Personal Loan for BPCL Employees - To meet their day to day needs (Link: //bankofmaharashtra.bank.in/mahabank-personalloan-scheme-bpcl-employees)\n==========================================================================", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_17", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 2, "content": "================================================== ======\n--- SALARIED CUSTOMERS PERSONAL LOAN SCHEME DETAILS ---\n================================================================================\nTitle: Bank of Maharashtra - Personal Loan for Salaried customers\nURL: https://bankofmaharashtra.bank.in/personal-loan-for-salaried-customers\n--- Maha Bank Personal Loan scheme for Salaried customers ---\n1\nParticulars: Name of the scheme\nScheme Guidelines: MAHA BANK PERSONAL LOAN SCHEME- for Salaried customers\n2\nParticulars: Type of Facility\nScheme Guidelines: Term ", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_18", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 3, "content": "iculars: Type of Facility\nScheme Guidelines: Term  Loan\n3\nParticulars: Purpose of loan\nScheme Guidelines: To cater to the requirements of meeting personal expenses.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_19", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 4, "content": " to the requirements of meeting personal expenses. 4\nParticulars: Eligibility\nScheme Guidelines: Borrowers are categorized in three category based on employment. Category –A. –\nConfirmed Employees of Central Govt. / State Govt. / Public Sector Undertakings/ Govt. Educational Institutions having Salary Account with BOM or any other Bank. Satisfactory account relationship with our Bank or any other Bank. Category –B. –\nConfirmed Employees of Private / Public Limited Company having external rating \"A\" & above having Salary Account with BOM or any other Bank.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_20", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 5, "content": " having Salary Account with BOM or any other Bank. Satisfactory salary account relationship with Bank for at least -6- months. Category C. –\nOther Salary account holders (Confirmed Employees) whose salary is credited in our Bank and tie up arrangement with employer or irrevocable undertaking from employer is available. 5\nParticulars: Min Annual Income\nScheme Guidelines: Minimum annual Income – 3.00 Lakhs. Minimum past 1 year ITR/Form 16 is Mandatory from current employer. 6\nParticulars: Maximum Quantum of Finance\nScheme Guidelines: Maximum Rs 20.00 Lakhs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_21", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 6, "content": "Finance\nScheme Guidelines: Maximum Rs 20.00 Lakhs. Loan amount is 20 times of Gross Monthly Income or as per Maximum Quantum of Finance whichever is lower. 7\nParticulars: Margin\nScheme Guidelines: Nil\n8\nParticulars: Age Limit\nScheme Guidelines: Minimum:: 21 Years\nMaximum:58 Years at the time of sanction\nAge of Borrower plus repayment period should not exceed retirement age or 60 years of age, whichever is lower.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_22", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 7, "content": "rement age or 60 years of age, whichever is lower. 9\nParticulars: Repayment Period\nScheme Guidelines: For Category A\nSalary Account with Bank of Maharashtra - 84 months\nSalary Account with Other Bank -60 months\nFor Category B & C\n60 months\n10\nParticulars: Rate of Interest\nScheme Guidelines: Click here to view the   Interest Rate\n11\nParticulars: Deduction\nScheme Guidelines: For Category A\nNot to Exceed 65% of the Gross Monthly Income including Proposed EMI. For Category B & C\nNot to Exceed 60% of the Gross Monthly Income including Proposed EMI.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_23", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 8, "content": "f the Gross Monthly Income including Proposed EMI. 12\nParticulars: Security\nScheme Guidelines: Nil (Clean Loan)\n13\nParticulars: Guarantor\nScheme Guidelines: Not required\n14\nParticulars: Processing Fee\nScheme Guidelines: 1.00 % of the loan amount + GST (Min: Rs 1000/-)\n15\nParticulars: Documentation charge\nScheme Guidelines: 0.20% of the loan amount + GST\n--- Calculate EMI ---\nLink: /personalloan-emi-calculator\n================================================================================\n--- MAHA BANK PERSONAL LOAN SCHEME FOR PROFESSIONALS DETAILS ---\n====", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_24", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 9, "content": "NAL LOAN SCHEME FOR PROFESSIONALS DETAILS ---\n==== ============================================================================\nTitle: Personal Loan for Professionals at Bank of Maharashtra\nURL: https://bankofmaharashtra.bank.in/personal-loan-for-professionals\n--- Maha Bank Personal Loan scheme for Professionals ---\n1\nParticulars: Name of the scheme\nScheme Guidelines: MAHA BANK PERSONAL LOAN SCHEME FOR PROFESSIONALS.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_25", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 10, "content": " MAHA BANK PERSONAL LOAN SCHEME FOR PROFESSIONALS. 2\nParticulars: Type of Facility\nScheme Guidelines: Term Loan\n3\nParticulars: Purpose of loan\nScheme Guidelines: To cater to the requirements of meeting personal expenses. 4\nParticulars: Eligibility\nScheme Guidelines: Self Employed Professional having account relationship with our Bank. *Self Employed Professionals includes Qualified and registered CAs, Doctors (Medical practitioners with minimum qualification MBBS/MD/MS/Dentist -MDS), Architects & Company Secretaries, with their own practicing.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_26", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 11, "content": " & Company Secretaries, with their own practicing. 5\nParticulars: Age Limit\nScheme Guidelines: Minimum: 21 Years\nAge of Borrower plus repayment period should not exceed -65- years. 6\nParticulars: Min Annual Income\nScheme Guidelines: Minimum annual Income – 3.00 Lakhs. Minimum past 2 year ITR/Form 16 is Mandatory from current employer. 7\nParticulars: Maximum Quantum of Finance\nScheme Guidelines: Rs 20.00 Lakhs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_27", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 12, "content": "ntum of Finance\nScheme Guidelines: Rs 20.00 Lakhs. 8\nParticulars: Margin\nScheme Guidelines: Nil\n9\nParticulars: Repayment Period\nScheme Guidelines: 60 months\n10\nParticulars: Rate of Interest\nScheme Guidelines: Click here to view the   Interest Rate\n11\nParticulars: Deduction\nScheme Guidelines: 60% of Gross Average Annual Income of last two years.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_28", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 13, "content": " of Gross Average Annual Income of last two years. 12\nParticulars: Security\nScheme Guidelines: Nil (Clean Loan)\n13\nParticulars: Guarantor\nScheme Guidelines: Not required\n14\nParticulars: Processing Fee\nScheme Guidelines: 1.00 % of the loan amount + GST (Min: Rs 1000/-)\n15\nParticulars: Documentation charge\nScheme Guidelines: 0.20% of the loan amount + GST\n--- Calculate EMI ---\nLink: /personalloan-emi-calculator\n================================================================================\n--- MAHA BANK PERSONAL LOAN SCHEME FOR BUSINESS CLASS HAVING HOME LOA", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_29", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 14, "content": "NAL LOAN SCHEME FOR BUSINESS CLASS HAVING HOME LOA N WITH US DETAILS ---\n================================================================================\nTitle: Best Personal Loan for Business Class by Bank of Maharashtra\nURL: https://bankofmaharashtra.bank.in/personal-loan-for-businessclass-having-home-loan-with-us\n--- MAHA BANK PERSONAL LOAN SCHEME- for Business Class having Home Loan with us ---\n1\nParticulars: Name of the scheme\nScheme Guidelines: MAHA BANK PERSONAL LOAN SCHEME- for Business Class having Home Loan with us.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_30", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 15, "content": "HEME- for Business Class having Home Loan with us. 2\nParticulars: Type of Facility\nScheme Guidelines: Term Loan\n3\nParticulars: Purpose of loan\nScheme Guidelines: To cater to the requirements of meeting personal expenses. 4\nParticulars: Eligibility\nScheme Guidelines: For existing Home Loan applicant to avail the Personal he/ she should have a satisfactory track record of repayment of Home loan EMI up to 6 months and there should not be any overdue in the Home Loan A/c. i.e.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_31", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 16, "content": "ould not be any overdue in the Home Loan A/c. i.e. the account should not have been classified under SMA category during the last 6 months' period. 5\nParticulars: Age Limit\nScheme Guidelines: Minimum: 21 Years\nAge of Borrower plus repayment period should not exceed -65- years. 6\nParticulars: Min Annual Income\nScheme Guidelines: Minimum annual Income – 3.00 Lakhs. Minimum past 2 year ITR/Form 16 is Mandatory from current employer. 7\nParticulars: Maximum Quantum of Finance\nScheme Guidelines: Rs 20.00 Lakhs.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_32", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 17, "content": "ntum of Finance\nScheme Guidelines: Rs 20.00 Lakhs. 8\nParticulars: Margin\nScheme Guidelines: Nil\n9\nParticulars: Repayment Period\nScheme Guidelines: 84 months\n10\nParticulars: Rate of Interest\nScheme Guidelines: Click here to view the   Interest Rate\n11\nParticulars: Deduction\nScheme Guidelines: 65% of Gross Annual Income of last year including Proposed EMI.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_chunk_33", "original_file": "script_9.txt", "section_index": 4, "chunk_index": 18, "content": "Annual Income of last year including Proposed EMI. 12\nParticulars: Security\nScheme Guidelines: Nil (Clean Loan)\n13\nParticulars: Guarantor\nScheme Guidelines: Not required\n14\nParticulars: Processing Fee\nScheme Guidelines: 1.00 % of the loan amount + GST (Min: Rs 1000/-)\n15\nParticulars: Documentation charge\nScheme Guidelines: 0.20% of the loan amount + GST\n--- Calculate EMI ---\nLink: /personalloan-emi-calculator", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9.txt-4"}
{"chunk_id": "script_9_1_chunk_0", "original_file": "script_9_1.txt", "section_index": 0, "chunk_index": 0, "content": "Loan amount is 20 times of Gross Monthly Income or as per Maximum Quantum of Finance whichever is lower\nParticulars: Margin\nScheme Guidelines: Nil\nParticulars: Repayment Period\nScheme Guidelines: 84 months\nParticulars: Rate of Interest\nScheme Guidelines: RLLR + 1.65 %\nParticulars: Deduction\nScheme Guidelines: Not to Exceed 60% of the Gross Income including Proposed EMI / Notional Interest.", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9_1.txt-0"}
{"chunk_id": "script_9_1_chunk_1", "original_file": "script_9_1.txt", "section_index": 0, "chunk_index": 1, "content": "Income including Proposed EMI / Notional Interest. (In case of existing Housing loan borrowers 65% of Gross income including proposed EMI)\nParticulars: Security\nScheme Guidelines: Nil (Clean Loan)\nParticulars: Guarantor\nScheme Guidelines: One Guarantor acceptable to the Bank\nParticulars: Processing Fee\nScheme Guidelines: Nil\n--- Calculate EMI ---\nLink: /personalloan-emi-calculator\n--- Apply Now ---\nLink: //digileads.bankofmaharashtra.bank.in/personal?bom", "scraped_date": "2025-12-12T13:31:38.176029", "original_id": "script_9_1.txt-0"}
